GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.h
extern volatile WDTTMRbits_t WDTTMRbits __at(0x07C);
// bitfield macros
#define _WDTTMR_PSCNT16_POSN                                0x0
#define _WDTTMR_PSCNT16_POSITION                            0x0
#define _WDTTMR_PSCNT16_SIZE                                0x1
#define _WDTTMR_PSCNT16_LENGTH                              0x1
#define _WDTTMR_PSCNT16_MASK                                0x1
#define _WDTTMR_PSCNT17_POSN                                0x1
#define _WDTTMR_PSCNT17_POSITION                            0x1
#define _WDTTMR_PSCNT17_SIZE                                0x1
#define _WDTTMR_PSCNT17_LENGTH                              0x1
#define _WDTTMR_PSCNT17_MASK                                0x2
#define _WDTTMR_STATE_POSN                                  0x2
#define _WDTTMR_STATE_POSITION                              0x2
#define _WDTTMR_STATE_SIZE                                  0x1
#define _WDTTMR_STATE_LENGTH                                0x1
#define _WDTTMR_STATE_MASK                                  0x4
#define _WDTTMR_TMR_POSN                                    0x3
#define _WDTTMR_TMR_POSITION                                0x3
#define _WDTTMR_TMR_SIZE                                    0x5
#define _WDTTMR_TMR_LENGTH                                  0x5
#define _WDTTMR_TMR_MASK                                    0xF8
#define _WDTTMR_WDTPSCNT16_POSN                             0x0
#define _WDTTMR_WDTPSCNT16_POSITION                         0x0
#define _WDTTMR_WDTPSCNT16_SIZE                             0x1
#define _WDTTMR_WDTPSCNT16_LENGTH                           0x1
#define _WDTTMR_WDTPSCNT16_MASK                             0x1
#define _WDTTMR_WDTPSCNT17_POSN                             0x1
#define _WDTTMR_WDTPSCNT17_POSITION                         0x1
#define _WDTTMR_WDTPSCNT17_SIZE                             0x1
#define _WDTTMR_WDTPSCNT17_LENGTH                           0x1
#define _WDTTMR_WDTPSCNT17_MASK                             0x2
#define _WDTTMR_WDTSTATE_POSN                               0x2
#define _WDTTMR_WDTSTATE_POSITION                           0x2
#define _WDTTMR_WDTSTATE_SIZE                               0x1
#define _WDTTMR_WDTSTATE_LENGTH                             0x1
#define _WDTTMR_WDTSTATE_MASK                               0x4
#define _WDTTMR_WDTTMR0_POSN                                0x3
#define _WDTTMR_WDTTMR0_POSITION                            0x3
#define _WDTTMR_WDTTMR0_SIZE                                0x1
#define _WDTTMR_WDTTMR0_LENGTH                              0x1
#define _WDTTMR_WDTTMR0_MASK                                0x8
#define _WDTTMR_WDTTMR1_POSN                                0x4
#define _WDTTMR_WDTTMR1_POSITION                            0x4
#define _WDTTMR_WDTTMR1_SIZE                                0x1
#define _WDTTMR_WDTTMR1_LENGTH                              0x1
#define _WDTTMR_WDTTMR1_MASK                                0x10
#define _WDTTMR_WDTTMR2_POSN                                0x5
#define _WDTTMR_WDTTMR2_POSITION                            0x5
#define _WDTTMR_WDTTMR2_SIZE                                0x1
#define _WDTTMR_WDTTMR2_LENGTH                              0x1
#define _WDTTMR_WDTTMR2_MASK                                0x20
#define _WDTTMR_WDTTMR3_POSN                                0x6
#define _WDTTMR_WDTTMR3_POSITION                            0x6
#define _WDTTMR_WDTTMR3_SIZE                                0x1
#define _WDTTMR_WDTTMR3_LENGTH                              0x1
#define _WDTTMR_WDTTMR3_MASK                                0x40
#define _WDTTMR_WDTTMR4_POSN                                0x7
#define _WDTTMR_WDTTMR4_POSITION                            0x7
#define _WDTTMR_WDTTMR4_SIZE                                0x1
#define _WDTTMR_WDTTMR4_LENGTH                              0x1
#define _WDTTMR_WDTTMR4_MASK                                0x80
#define _WDTTMR_WDTTMR_POSN                                 0x3
#define _WDTTMR_WDTTMR_POSITION                             0x3
#define _WDTTMR_WDTTMR_SIZE                                 0x5
#define _WDTTMR_WDTTMR_LENGTH                               0x5
#define _WDTTMR_WDTTMR_MASK                                 0xF8

// Register: DAC1DAT
#define DAC1DAT DAC1DAT
extern volatile unsigned char           DAC1DAT             __at(0x07D);
#ifndef _LIB_BUILD
asm("DAC1DAT equ 07Dh");
#endif

// Register: DAC1DATL
#define DAC1DATL DAC1DATL
extern volatile unsigned char           DAC1DATL            __at(0x07D);
#ifndef _LIB_BUILD
asm("DAC1DATL equ 07Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :8;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
        unsigned DAC1R5                 :1;
        unsigned DAC1R6                 :1;
        unsigned DAC1R7                 :1;
    };
    struct {
        unsigned DAC1RL                 :8;
    };
} DAC1DATLbits_t;
extern volatile DAC1DATLbits_t DAC1DATLbits __at(0x07D);
// bitfield macros
#define _DAC1DATL_DAC1R_POSN                                0x0
#define _DAC1DATL_DAC1R_POSITION                            0x0
#define _DAC1DATL_DAC1R_SIZE                                0x8
#define _DAC1DATL_DAC1R_LENGTH                              0x8
#define _DAC1DATL_DAC1R_MASK                                0xFF
#define _DAC1DATL_DAC1R0_POSN                               0x0
#define _DAC1DATL_DAC1R0_POSITION                           0x0
#define _DAC1DATL_DAC1R0_SIZE                               0x1
#define _DAC1DATL_DAC1R0_LENGTH                             0x1
#define _DAC1DATL_DAC1R0_MASK                               0x1
#define _DAC1DATL_DAC1R1_POSN                               0x1
#define _DAC1DATL_DAC1R1_POSITION                           0x1
#define _DAC1DATL_DAC1R1_SIZE                               0x1
#define _DAC1DATL_DAC1R1_LENGTH                             0x1
#define _DAC1DATL_DAC1R1_MASK                               0x2
#define _DAC1DATL_DAC1R2_POSN                               0x2
#define _DAC1DATL_DAC1R2_POSITION                           0x2
#define _DAC1DATL_DAC1R2_SIZE                               0x1
#define _DAC1DATL_DAC1R2_LENGTH                             0x1
#define _DAC1DATL_DAC1R2_MASK                               0x4
#define _DAC1DATL_DAC1R3_POSN                               0x3
#define _DAC1DATL_DAC1R3_POSITION                           0x3
#define _DAC1DATL_DAC1R3_SIZE                               0x1
#define _DAC1DATL_DAC1R3_LENGTH                             0x1
#define _DAC1DATL_DAC1R3_MASK                               0x8
#define _DAC1DATL_DAC1R4_POSN                               0x4
#define _DAC1DATL_DAC1R4_POSITION                           0x4
#define _DAC1DATL_DAC1R4_SIZE                               0x1
#define _DAC1DATL_DAC1R4_LENGTH                             0x1
#define _DAC1DATL_DAC1R4_MASK                               0x10
#define _DAC1DATL_DAC1R5_POSN                               0x5
#define _DAC1DATL_DAC1R5_POSITION                           0x5
#define _DAC1DATL_DAC1R5_SIZE                               0x1
#define _DAC1DATL_DAC1R5_LENGTH                             0x1
#define _DAC1DATL_DAC1R5_MASK                               0x20
#define _DAC1DATL_DAC1R6_POSN                               0x6
#define _DAC1DATL_DAC1R6_POSITION                           0x6
#define _DAC1DATL_DAC1R6_SIZE                               0x1
#define _DAC1DATL_DAC1R6_LENGTH                             0x1
#define _DAC1DATL_DAC1R6_MASK                               0x40
#define _DAC1DATL_DAC1R7_POSN                               0x7
#define _DAC1DATL_DAC1R7_POSITION                           0x7
#define _DAC1DATL_DAC1R7_SIZE                               0x1
#define _DAC1DATL_DAC1R7_LENGTH                             0x1
#define _DAC1DATL_DAC1R7_MASK                               0x80
#define _DAC1DATL_DAC1RL_POSN                               0x0
#define _DAC1DATL_DAC1RL_POSITION                           0x0
#define _DAC1DATL_DAC1RL_SIZE                               0x8
#define _DAC1DATL_DAC1RL_LENGTH                             0x8
#define _DAC1DATL_DAC1RL_MASK                               0xFF

