GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.h
extern volatile DMA4PRbits_t DMA4PRbits __at(0x0B9);
// bitfield macros
#define _DMA4PR_PR_POSN                                     0x0
#define _DMA4PR_PR_POSITION                                 0x0
#define _DMA4PR_PR_SIZE                                     0x3
#define _DMA4PR_PR_LENGTH                                   0x3
#define _DMA4PR_PR_MASK                                     0x7
#define _DMA4PR_PR0_POSN                                    0x0
#define _DMA4PR_PR0_POSITION                                0x0
#define _DMA4PR_PR0_SIZE                                    0x1
#define _DMA4PR_PR0_LENGTH                                  0x1
#define _DMA4PR_PR0_MASK                                    0x1
#define _DMA4PR_PR1_POSN                                    0x1
#define _DMA4PR_PR1_POSITION                                0x1
#define _DMA4PR_PR1_SIZE                                    0x1
#define _DMA4PR_PR1_LENGTH                                  0x1
#define _DMA4PR_PR1_MASK                                    0x2
#define _DMA4PR_PR2_POSN                                    0x2
#define _DMA4PR_PR2_POSITION                                0x2
#define _DMA4PR_PR2_SIZE                                    0x1
#define _DMA4PR_PR2_LENGTH                                  0x1
#define _DMA4PR_PR2_MASK                                    0x4
#define _DMA4PR_DMA4PR_POSN                                 0x0
#define _DMA4PR_DMA4PR_POSITION                             0x0
#define _DMA4PR_DMA4PR_SIZE                                 0x3
#define _DMA4PR_DMA4PR_LENGTH                               0x3
#define _DMA4PR_DMA4PR_MASK                                 0x7
#define _DMA4PR_DMA4PR0_POSN                                0x0
#define _DMA4PR_DMA4PR0_POSITION                            0x0
#define _DMA4PR_DMA4PR0_SIZE                                0x1
#define _DMA4PR_DMA4PR0_LENGTH                              0x1
#define _DMA4PR_DMA4PR0_MASK                                0x1
#define _DMA4PR_DMA4PR1_POSN                                0x1
#define _DMA4PR_DMA4PR1_POSITION                            0x1
#define _DMA4PR_DMA4PR1_SIZE                                0x1
#define _DMA4PR_DMA4PR1_LENGTH                              0x1
#define _DMA4PR_DMA4PR1_MASK                                0x2
#define _DMA4PR_DMA4PR2_POSN                                0x2
#define _DMA4PR_DMA4PR2_POSITION                            0x2
#define _DMA4PR_DMA4PR2_SIZE                                0x1
#define _DMA4PR_DMA4PR2_LENGTH                              0x1
#define _DMA4PR_DMA4PR2_MASK                                0x4

// Register: MAINPR
#define MAINPR MAINPR
extern volatile unsigned char           MAINPR              __at(0x0BE);
#ifndef _LIB_BUILD
asm("MAINPR equ 0BEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned MAINPR                 :3;
    };
    struct {
        unsigned MAINPR0                :1;
        unsigned MAINPR1                :1;
        unsigned MAINPR2                :1;
    };
} MAINPRbits_t;
extern volatile MAINPRbits_t MAINPRbits __at(0x0BE);
// bitfield macros
#define _MAINPR_PR_POSN                                     0x0
#define _MAINPR_PR_POSITION                                 0x0
#define _MAINPR_PR_SIZE                                     0x3
#define _MAINPR_PR_LENGTH                                   0x3
#define _MAINPR_PR_MASK                                     0x7
#define _MAINPR_PR0_POSN                                    0x0
#define _MAINPR_PR0_POSITION                                0x0
#define _MAINPR_PR0_SIZE                                    0x1
#define _MAINPR_PR0_LENGTH                                  0x1
#define _MAINPR_PR0_MASK                                    0x1
#define _MAINPR_PR1_POSN                                    0x1
#define _MAINPR_PR1_POSITION                                0x1
#define _MAINPR_PR1_SIZE                                    0x1
#define _MAINPR_PR1_LENGTH                                  0x1
#define _MAINPR_PR1_MASK                                    0x2
#define _MAINPR_PR2_POSN                                    0x2
#define _MAINPR_PR2_POSITION                                0x2
#define _MAINPR_PR2_SIZE                                    0x1
#define _MAINPR_PR2_LENGTH                                  0x1
#define _MAINPR_PR2_MASK                                    0x4
#define _MAINPR_MAINPR_POSN                                 0x0
#define _MAINPR_MAINPR_POSITION                             0x0
#define _MAINPR_MAINPR_SIZE                                 0x3
#define _MAINPR_MAINPR_LENGTH                               0x3
#define _MAINPR_MAINPR_MASK                                 0x7
#define _MAINPR_MAINPR0_POSN                                0x0
#define _MAINPR_MAINPR0_POSITION                            0x0
#define _MAINPR_MAINPR0_SIZE                                0x1
#define _MAINPR_MAINPR0_LENGTH                              0x1
#define _MAINPR_MAINPR0_MASK                                0x1
#define _MAINPR_MAINPR1_POSN                                0x1
#define _MAINPR_MAINPR1_POSITION                            0x1
#define _MAINPR_MAINPR1_SIZE                                0x1
#define _MAINPR_MAINPR1_LENGTH                              0x1
#define _MAINPR_MAINPR1_MASK                                0x2
#define _MAINPR_MAINPR2_POSN                                0x2
#define _MAINPR_MAINPR2_POSITION                            0x2
#define _MAINPR_MAINPR2_SIZE                                0x1
#define _MAINPR_MAINPR2_LENGTH                              0x1
#define _MAINPR_MAINPR2_MASK                                0x4

// Register: ISRPR
#define ISRPR ISRPR
extern volatile unsigned char           ISRPR               __at(0x0BF);
#ifndef _LIB_BUILD
asm("ISRPR equ 0BFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned ISRPR                  :3;
    };
    struct {
        unsigned ISRPR0                 :1;
        unsigned ISRPR1                 :1;
        unsigned ISRPR2                 :1;
    };
} ISRPRbits_t;
extern volatile ISRPRbits_t ISRPRbits __at(0x0BF);
// bitfield macros
#define _ISRPR_PR_POSN                                      0x0
#define _ISRPR_PR_POSITION                                  0x0
#define _ISRPR_PR_SIZE                                      0x3
#define _ISRPR_PR_LENGTH                                    0x3
#define _ISRPR_PR_MASK                                      0x7
#define _ISRPR_PR0_POSN                                     0x0
#define _ISRPR_PR0_POSITION                                 0x0
#define _ISRPR_PR0_SIZE                                     0x1
#define _ISRPR_PR0_LENGTH                                   0x1
#define _ISRPR_PR0_MASK                                     0x1
#define _ISRPR_PR1_POSN                                     0x1
#define _ISRPR_PR1_POSITION                                 0x1
#define _ISRPR_PR1_SIZE                                     0x1
#define _ISRPR_PR1_LENGTH                                   0x1
#define _ISRPR_PR1_MASK                                     0x2
#define _ISRPR_PR2_POSN                                     0x2
#define _ISRPR_PR2_POSITION                                 0x2
#define _ISRPR_PR2_SIZE                                     0x1
#define _ISRPR_PR2_LENGTH                                   0x1
#define _ISRPR_PR2_MASK                                     0x4
#define _ISRPR_ISRPR_POSN                                   0x0
#define _ISRPR_ISRPR_POSITION                               0x0
#define _ISRPR_ISRPR_SIZE                                   0x3
#define _ISRPR_ISRPR_LENGTH                                 0x3
#define _ISRPR_ISRPR_MASK                                   0x7
#define _ISRPR_ISRPR0_POSN                                  0x0
#define _ISRPR_ISRPR0_POSITION                              0x0
#define _ISRPR_ISRPR0_SIZE                                  0x1
#define _ISRPR_ISRPR0_LENGTH                                0x1
#define _ISRPR_ISRPR0_MASK                                  0x1
#define _ISRPR_ISRPR1_POSN                                  0x1
#define _ISRPR_ISRPR1_POSITION                              0x1
#define _ISRPR_ISRPR1_SIZE                                  0x1
#define _ISRPR_ISRPR1_LENGTH                                0x1
#define _ISRPR_ISRPR1_MASK                                  0x2
#define _ISRPR_ISRPR2_POSN                                  0x2
#define _ISRPR_ISRPR2_POSITION                              0x2
#define _ISRPR_ISRPR2_SIZE                                  0x1
#define _ISRPR_ISRPR2_LENGTH                                0x1
#define _ISRPR_ISRPR2_MASK                                  0x4

// Register: CLCDATA
#define CLCDATA CLCDATA
extern volatile unsigned char           CLCDATA             __at(0x0D4);
#ifndef _LIB_BUILD
asm("CLCDATA equ 0D4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC1OUT                :1;
        unsigned CLC2OUT                :1;
        unsigned CLC3OUT                :1;
        unsigned CLC4OUT                :1;
    };
} CLCDATAbits_t;
