GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.h
// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
extern volatile unsigned char           CLCIN0PPS           __at(0x261);
#ifndef _LIB_BUILD
asm("CLCIN0PPS equ 0261h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned CLCIN0PPS0             :1;
        unsigned CLCIN0PPS1             :1;
        unsigned CLCIN0PPS2             :1;
        unsigned CLCIN0PPS3             :1;
        unsigned CLCIN0PPS4             :1;
        unsigned CLCIN0PPS5             :1;
    };
    struct {
        unsigned CLCIN0PPS              :6;
    };
} CLCIN0PPSbits_t;
extern volatile CLCIN0PPSbits_t CLCIN0PPSbits __at(0x261);
// bitfield macros
#define _CLCIN0PPS_PIN_POSN                                 0x0
#define _CLCIN0PPS_PIN_POSITION                             0x0
#define _CLCIN0PPS_PIN_SIZE                                 0x3
#define _CLCIN0PPS_PIN_LENGTH                               0x3
#define _CLCIN0PPS_PIN_MASK                                 0x7
#define _CLCIN0PPS_PORT_POSN                                0x3
#define _CLCIN0PPS_PORT_POSITION                            0x3
#define _CLCIN0PPS_PORT_SIZE                                0x3
#define _CLCIN0PPS_PORT_LENGTH                              0x3
#define _CLCIN0PPS_PORT_MASK                                0x38
#define _CLCIN0PPS_CLCIN0PPS0_POSN                          0x0
#define _CLCIN0PPS_CLCIN0PPS0_POSITION                      0x0
#define _CLCIN0PPS_CLCIN0PPS0_SIZE                          0x1
#define _CLCIN0PPS_CLCIN0PPS0_LENGTH                        0x1
#define _CLCIN0PPS_CLCIN0PPS0_MASK                          0x1
#define _CLCIN0PPS_CLCIN0PPS1_POSN                          0x1
#define _CLCIN0PPS_CLCIN0PPS1_POSITION                      0x1
#define _CLCIN0PPS_CLCIN0PPS1_SIZE                          0x1
#define _CLCIN0PPS_CLCIN0PPS1_LENGTH                        0x1
#define _CLCIN0PPS_CLCIN0PPS1_MASK                          0x2
#define _CLCIN0PPS_CLCIN0PPS2_POSN                          0x2
#define _CLCIN0PPS_CLCIN0PPS2_POSITION                      0x2
#define _CLCIN0PPS_CLCIN0PPS2_SIZE                          0x1
#define _CLCIN0PPS_CLCIN0PPS2_LENGTH                        0x1
#define _CLCIN0PPS_CLCIN0PPS2_MASK                          0x4
#define _CLCIN0PPS_CLCIN0PPS3_POSN                          0x3
#define _CLCIN0PPS_CLCIN0PPS3_POSITION                      0x3
#define _CLCIN0PPS_CLCIN0PPS3_SIZE                          0x1
#define _CLCIN0PPS_CLCIN0PPS3_LENGTH                        0x1
#define _CLCIN0PPS_CLCIN0PPS3_MASK                          0x8
#define _CLCIN0PPS_CLCIN0PPS4_POSN                          0x4
#define _CLCIN0PPS_CLCIN0PPS4_POSITION                      0x4
#define _CLCIN0PPS_CLCIN0PPS4_SIZE                          0x1
#define _CLCIN0PPS_CLCIN0PPS4_LENGTH                        0x1
#define _CLCIN0PPS_CLCIN0PPS4_MASK                          0x10
#define _CLCIN0PPS_CLCIN0PPS5_POSN                          0x5
#define _CLCIN0PPS_CLCIN0PPS5_POSITION                      0x5
#define _CLCIN0PPS_CLCIN0PPS5_SIZE                          0x1
#define _CLCIN0PPS_CLCIN0PPS5_LENGTH                        0x1
#define _CLCIN0PPS_CLCIN0PPS5_MASK                          0x20
#define _CLCIN0PPS_CLCIN0PPS_POSN                           0x0
#define _CLCIN0PPS_CLCIN0PPS_POSITION                       0x0
#define _CLCIN0PPS_CLCIN0PPS_SIZE                           0x6
#define _CLCIN0PPS_CLCIN0PPS_LENGTH                         0x6
#define _CLCIN0PPS_CLCIN0PPS_MASK                           0x3F

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
extern volatile unsigned char           CLCIN1PPS           __at(0x262);
#ifndef _LIB_BUILD
asm("CLCIN1PPS equ 0262h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned CLCIN1PPS0             :1;
        unsigned CLCIN1PPS1             :1;
        unsigned CLCIN1PPS2             :1;
        unsigned CLCIN1PPS3             :1;
        unsigned CLCIN1PPS4             :1;
        unsigned CLCIN1PPS5             :1;
    };
    struct {
        unsigned CLCIN1PPS              :6;
    };
} CLCIN1PPSbits_t;
extern volatile CLCIN1PPSbits_t CLCIN1PPSbits __at(0x262);
// bitfield macros
#define _CLCIN1PPS_PIN_POSN                                 0x0
#define _CLCIN1PPS_PIN_POSITION                             0x0
#define _CLCIN1PPS_PIN_SIZE                                 0x3
#define _CLCIN1PPS_PIN_LENGTH                               0x3
#define _CLCIN1PPS_PIN_MASK                                 0x7
#define _CLCIN1PPS_PORT_POSN                                0x3
#define _CLCIN1PPS_PORT_POSITION                            0x3
#define _CLCIN1PPS_PORT_SIZE                                0x3
#define _CLCIN1PPS_PORT_LENGTH                              0x3
#define _CLCIN1PPS_PORT_MASK                                0x38
#define _CLCIN1PPS_CLCIN1PPS0_POSN                          0x0
#define _CLCIN1PPS_CLCIN1PPS0_POSITION                      0x0
#define _CLCIN1PPS_CLCIN1PPS0_SIZE                          0x1
#define _CLCIN1PPS_CLCIN1PPS0_LENGTH                        0x1
#define _CLCIN1PPS_CLCIN1PPS0_MASK                          0x1
#define _CLCIN1PPS_CLCIN1PPS1_POSN                          0x1
#define _CLCIN1PPS_CLCIN1PPS1_POSITION                      0x1
#define _CLCIN1PPS_CLCIN1PPS1_SIZE                          0x1
#define _CLCIN1PPS_CLCIN1PPS1_LENGTH                        0x1
#define _CLCIN1PPS_CLCIN1PPS1_MASK                          0x2
#define _CLCIN1PPS_CLCIN1PPS2_POSN                          0x2
#define _CLCIN1PPS_CLCIN1PPS2_POSITION                      0x2
#define _CLCIN1PPS_CLCIN1PPS2_SIZE                          0x1
#define _CLCIN1PPS_CLCIN1PPS2_LENGTH                        0x1
#define _CLCIN1PPS_CLCIN1PPS2_MASK                          0x4
#define _CLCIN1PPS_CLCIN1PPS3_POSN                          0x3
#define _CLCIN1PPS_CLCIN1PPS3_POSITION                      0x3
#define _CLCIN1PPS_CLCIN1PPS3_SIZE                          0x1
#define _CLCIN1PPS_CLCIN1PPS3_LENGTH                        0x1
#define _CLCIN1PPS_CLCIN1PPS3_MASK                          0x8
#define _CLCIN1PPS_CLCIN1PPS4_POSN                          0x4
#define _CLCIN1PPS_CLCIN1PPS4_POSITION                      0x4
#define _CLCIN1PPS_CLCIN1PPS4_SIZE                          0x1
#define _CLCIN1PPS_CLCIN1PPS4_LENGTH                        0x1
#define _CLCIN1PPS_CLCIN1PPS4_MASK                          0x10
#define _CLCIN1PPS_CLCIN1PPS5_POSN                          0x5
#define _CLCIN1PPS_CLCIN1PPS5_POSITION                      0x5
#define _CLCIN1PPS_CLCIN1PPS5_SIZE                          0x1
#define _CLCIN1PPS_CLCIN1PPS5_LENGTH                        0x1
#define _CLCIN1PPS_CLCIN1PPS5_MASK                          0x20
#define _CLCIN1PPS_CLCIN1PPS_POSN                           0x0
#define _CLCIN1PPS_CLCIN1PPS_POSITION                       0x0
#define _CLCIN1PPS_CLCIN1PPS_SIZE                           0x6
#define _CLCIN1PPS_CLCIN1PPS_LENGTH                         0x6
#define _CLCIN1PPS_CLCIN1PPS_MASK                           0x3F

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
extern volatile unsigned char           CLCIN2PPS           __at(0x263);
#ifndef _LIB_BUILD
asm("CLCIN2PPS equ 0263h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned CLCIN2PPS0             :1;
        unsigned CLCIN2PPS1             :1;
        unsigned CLCIN2PPS2             :1;
        unsigned CLCIN2PPS3             :1;
        unsigned CLCIN2PPS4             :1;
        unsigned CLCIN2PPS5             :1;
    };
    struct {
        unsigned CLCIN2PPS              :6;
    };
} CLCIN2PPSbits_t;
extern volatile CLCIN2PPSbits_t CLCIN2PPSbits __at(0x263);
// bitfield macros
#define _CLCIN2PPS_PIN_POSN                                 0x0
#define _CLCIN2PPS_PIN_POSITION                             0x0
#define _CLCIN2PPS_PIN_SIZE                                 0x3
#define _CLCIN2PPS_PIN_LENGTH                               0x3
#define _CLCIN2PPS_PIN_MASK                                 0x7
#define _CLCIN2PPS_PORT_POSN                                0x3
#define _CLCIN2PPS_PORT_POSITION                            0x3
#define _CLCIN2PPS_PORT_SIZE                                0x3
#define _CLCIN2PPS_PORT_LENGTH                              0x3
#define _CLCIN2PPS_PORT_MASK                                0x38
#define _CLCIN2PPS_CLCIN2PPS0_POSN                          0x0
#define _CLCIN2PPS_CLCIN2PPS0_POSITION                      0x0
#define _CLCIN2PPS_CLCIN2PPS0_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS0_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS0_MASK                          0x1
#define _CLCIN2PPS_CLCIN2PPS1_POSN                          0x1
#define _CLCIN2PPS_CLCIN2PPS1_POSITION                      0x1
#define _CLCIN2PPS_CLCIN2PPS1_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS1_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS1_MASK                          0x2
#define _CLCIN2PPS_CLCIN2PPS2_POSN                          0x2
#define _CLCIN2PPS_CLCIN2PPS2_POSITION                      0x2
#define _CLCIN2PPS_CLCIN2PPS2_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS2_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS2_MASK                          0x4
#define _CLCIN2PPS_CLCIN2PPS3_POSN                          0x3
#define _CLCIN2PPS_CLCIN2PPS3_POSITION                      0x3
#define _CLCIN2PPS_CLCIN2PPS3_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS3_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS3_MASK                          0x8
#define _CLCIN2PPS_CLCIN2PPS4_POSN                          0x4
#define _CLCIN2PPS_CLCIN2PPS4_POSITION                      0x4
#define _CLCIN2PPS_CLCIN2PPS4_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS4_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS4_MASK                          0x10
#define _CLCIN2PPS_CLCIN2PPS5_POSN                          0x5
#define _CLCIN2PPS_CLCIN2PPS5_POSITION                      0x5
#define _CLCIN2PPS_CLCIN2PPS5_SIZE                          0x1
#define _CLCIN2PPS_CLCIN2PPS5_LENGTH                        0x1
#define _CLCIN2PPS_CLCIN2PPS5_MASK                          0x20
#define _CLCIN2PPS_CLCIN2PPS_POSN                           0x0
#define _CLCIN2PPS_CLCIN2PPS_POSITION                       0x0
#define _CLCIN2PPS_CLCIN2PPS_SIZE                           0x6
#define _CLCIN2PPS_CLCIN2PPS_LENGTH                         0x6
#define _CLCIN2PPS_CLCIN2PPS_MASK                           0x3F

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
extern volatile unsigned char           CLCIN3PPS           __at(0x264);
#ifndef _LIB_BUILD
asm("CLCIN3PPS equ 0264h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned CLCIN3PPS0             :1;
        unsigned CLCIN3PPS1             :1;
        unsigned CLCIN3PPS2             :1;
        unsigned CLCIN3PPS3             :1;
        unsigned CLCIN3PPS4             :1;
        unsigned CLCIN3PPS5             :1;
    };
    struct {
        unsigned CLCIN3PPS              :6;
    };
} CLCIN3PPSbits_t;
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0x264);
// bitfield macros
#define _CLCIN3PPS_PIN_POSN                                 0x0
#define _CLCIN3PPS_PIN_POSITION                             0x0
#define _CLCIN3PPS_PIN_SIZE                                 0x3
#define _CLCIN3PPS_PIN_LENGTH                               0x3
#define _CLCIN3PPS_PIN_MASK                                 0x7
#define _CLCIN3PPS_PORT_POSN                                0x3
#define _CLCIN3PPS_PORT_POSITION                            0x3
#define _CLCIN3PPS_PORT_SIZE                                0x3
#define _CLCIN3PPS_PORT_LENGTH                              0x3
#define _CLCIN3PPS_PORT_MASK                                0x38
#define _CLCIN3PPS_CLCIN3PPS0_POSN                          0x0
#define _CLCIN3PPS_CLCIN3PPS0_POSITION                      0x0
#define _CLCIN3PPS_CLCIN3PPS0_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS0_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS0_MASK                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_POSN                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_POSITION                      0x1
#define _CLCIN3PPS_CLCIN3PPS1_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS1_MASK                          0x2
#define _CLCIN3PPS_CLCIN3PPS2_POSN                          0x2
#define _CLCIN3PPS_CLCIN3PPS2_POSITION                      0x2
#define _CLCIN3PPS_CLCIN3PPS2_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS2_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS2_MASK                          0x4
#define _CLCIN3PPS_CLCIN3PPS3_POSN                          0x3
#define _CLCIN3PPS_CLCIN3PPS3_POSITION                      0x3
#define _CLCIN3PPS_CLCIN3PPS3_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS3_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS3_MASK                          0x8
#define _CLCIN3PPS_CLCIN3PPS4_POSN                          0x4
#define _CLCIN3PPS_CLCIN3PPS4_POSITION                      0x4
#define _CLCIN3PPS_CLCIN3PPS4_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS4_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS4_MASK                          0x10
#define _CLCIN3PPS_CLCIN3PPS5_POSN                          0x5
#define _CLCIN3PPS_CLCIN3PPS5_POSITION                      0x5
#define _CLCIN3PPS_CLCIN3PPS5_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS5_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS5_MASK                          0x20
#define _CLCIN3PPS_CLCIN3PPS_POSN                           0x0
#define _CLCIN3PPS_CLCIN3PPS_POSITION                       0x0
#define _CLCIN3PPS_CLCIN3PPS_SIZE                           0x6
#define _CLCIN3PPS_CLCIN3PPS_LENGTH                         0x6
#define _CLCIN3PPS_CLCIN3PPS_MASK                           0x3F

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
extern volatile unsigned char           ADACTPPS            __at(0x269);
#ifndef _LIB_BUILD
asm("ADACTPPS equ 0269h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned ADACTPPS0              :1;
        unsigned ADACTPPS1              :1;
        unsigned ADACTPPS2              :1;
        unsigned ADACTPPS3              :1;
        unsigned ADACTPPS4              :1;
        unsigned ADACTPPS5              :1;
    };
    struct {
        unsigned ADACTPPS               :6;
    };
} ADACTPPSbits_t;
extern volatile ADACTPPSbits_t ADACTPPSbits __at(0x269);
// bitfield macros
#define _ADACTPPS_PIN_POSN                                  0x0
#define _ADACTPPS_PIN_POSITION                              0x0
#define _ADACTPPS_PIN_SIZE                                  0x3
#define _ADACTPPS_PIN_LENGTH                                0x3
#define _ADACTPPS_PIN_MASK                                  0x7
#define _ADACTPPS_PORT_POSN                                 0x3
#define _ADACTPPS_PORT_POSITION                             0x3
#define _ADACTPPS_PORT_SIZE                                 0x3
#define _ADACTPPS_PORT_LENGTH                               0x3
#define _ADACTPPS_PORT_MASK                                 0x38
#define _ADACTPPS_ADACTPPS0_POSN                            0x0
#define _ADACTPPS_ADACTPPS0_POSITION                        0x0
#define _ADACTPPS_ADACTPPS0_SIZE                            0x1
#define _ADACTPPS_ADACTPPS0_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS0_MASK                            0x1
#define _ADACTPPS_ADACTPPS1_POSN                            0x1
#define _ADACTPPS_ADACTPPS1_POSITION                        0x1
#define _ADACTPPS_ADACTPPS1_SIZE                            0x1
#define _ADACTPPS_ADACTPPS1_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS1_MASK                            0x2
#define _ADACTPPS_ADACTPPS2_POSN                            0x2
#define _ADACTPPS_ADACTPPS2_POSITION                        0x2
#define _ADACTPPS_ADACTPPS2_SIZE                            0x1
#define _ADACTPPS_ADACTPPS2_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS2_MASK                            0x4
#define _ADACTPPS_ADACTPPS3_POSN                            0x3
#define _ADACTPPS_ADACTPPS3_POSITION                        0x3
#define _ADACTPPS_ADACTPPS3_SIZE                            0x1
#define _ADACTPPS_ADACTPPS3_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS3_MASK                            0x8
#define _ADACTPPS_ADACTPPS4_POSN                            0x4
#define _ADACTPPS_ADACTPPS4_POSITION                        0x4
#define _ADACTPPS_ADACTPPS4_SIZE                            0x1
#define _ADACTPPS_ADACTPPS4_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS4_MASK                            0x10
#define _ADACTPPS_ADACTPPS5_POSN                            0x5
#define _ADACTPPS_ADACTPPS5_POSITION                        0x5
#define _ADACTPPS_ADACTPPS5_SIZE                            0x1
#define _ADACTPPS_ADACTPPS5_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS5_MASK                            0x20
#define _ADACTPPS_ADACTPPS_POSN                             0x0
#define _ADACTPPS_ADACTPPS_POSITION                         0x0
#define _ADACTPPS_ADACTPPS_SIZE                             0x6
#define _ADACTPPS_ADACTPPS_LENGTH                           0x6
#define _ADACTPPS_ADACTPPS_MASK                             0x3F

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
extern volatile unsigned char           SPI1SCKPPS          __at(0x26A);
#ifndef _LIB_BUILD
asm("SPI1SCKPPS equ 026Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SPI1SCKPPS             :6;
    };
    struct {
        unsigned SPI1SCKPPS0            :1;
        unsigned SPI1SCKPPS1            :1;
        unsigned SPI1SCKPPS2            :1;
        unsigned SPI1SCKPPS3            :1;
        unsigned SPI1SCKPPS4            :1;
        unsigned SPI1SCKPPS5            :1;
    };
} SPI1SCKPPSbits_t;
extern volatile SPI1SCKPPSbits_t SPI1SCKPPSbits __at(0x26A);
// bitfield macros
#define _SPI1SCKPPS_PIN_POSN                                0x0
#define _SPI1SCKPPS_PIN_POSITION                            0x0
#define _SPI1SCKPPS_PIN_SIZE                                0x3
#define _SPI1SCKPPS_PIN_LENGTH                              0x3
#define _SPI1SCKPPS_PIN_MASK                                0x7
#define _SPI1SCKPPS_PORT_POSN                               0x3
#define _SPI1SCKPPS_PORT_POSITION                           0x3
#define _SPI1SCKPPS_PORT_SIZE                               0x3
#define _SPI1SCKPPS_PORT_LENGTH                             0x3
#define _SPI1SCKPPS_PORT_MASK                               0x38
#define _SPI1SCKPPS_SPI1SCKPPS_POSN                         0x0
#define _SPI1SCKPPS_SPI1SCKPPS_POSITION                     0x0
#define _SPI1SCKPPS_SPI1SCKPPS_SIZE                         0x6
#define _SPI1SCKPPS_SPI1SCKPPS_LENGTH                       0x6
#define _SPI1SCKPPS_SPI1SCKPPS_MASK                         0x3F
#define _SPI1SCKPPS_SPI1SCKPPS0_POSN                        0x0
#define _SPI1SCKPPS_SPI1SCKPPS0_POSITION                    0x0
#define _SPI1SCKPPS_SPI1SCKPPS0_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS0_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS0_MASK                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_POSN                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_POSITION                    0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_MASK                        0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_POSN                        0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_POSITION                    0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS2_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS2_MASK                        0x4
#define _SPI1SCKPPS_SPI1SCKPPS3_POSN                        0x3
#define _SPI1SCKPPS_SPI1SCKPPS3_POSITION                    0x3
#define _SPI1SCKPPS_SPI1SCKPPS3_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS3_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS3_MASK                        0x8
#define _SPI1SCKPPS_SPI1SCKPPS4_POSN                        0x4
#define _SPI1SCKPPS_SPI1SCKPPS4_POSITION                    0x4
#define _SPI1SCKPPS_SPI1SCKPPS4_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS4_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS4_MASK                        0x10
#define _SPI1SCKPPS_SPI1SCKPPS5_POSN                        0x5
#define _SPI1SCKPPS_SPI1SCKPPS5_POSITION                    0x5
#define _SPI1SCKPPS_SPI1SCKPPS5_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS5_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS5_MASK                        0x20

