GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.h
// Register: I2C1PIE
#define I2C1PIE I2C1PIE
extern volatile unsigned char           I2C1PIE             __at(0x29B);
#ifndef _LIB_BUILD
asm("I2C1PIE equ 029Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIE                   :1;
        unsigned RSCIE                  :1;
        unsigned PCIE                   :1;
        unsigned ADRIE                  :1;
        unsigned WRIE                   :1;
        unsigned                        :1;
        unsigned ACKTIE                 :1;
        unsigned CNTIE                  :1;
    };
    struct {
        unsigned SC1IE                  :1;
        unsigned RSC1IE                 :1;
        unsigned PC1IE                  :1;
        unsigned ADR1IE                 :1;
        unsigned WR1IE                  :1;
        unsigned                        :1;
        unsigned ACKT1IE                :1;
        unsigned CNT1IE                 :1;
    };
} I2C1PIEbits_t;
extern volatile I2C1PIEbits_t I2C1PIEbits __at(0x29B);
// bitfield macros
#define _I2C1PIE_SCIE_POSN                                  0x0
#define _I2C1PIE_SCIE_POSITION                              0x0
#define _I2C1PIE_SCIE_SIZE                                  0x1
#define _I2C1PIE_SCIE_LENGTH                                0x1
#define _I2C1PIE_SCIE_MASK                                  0x1
#define _I2C1PIE_RSCIE_POSN                                 0x1
#define _I2C1PIE_RSCIE_POSITION                             0x1
#define _I2C1PIE_RSCIE_SIZE                                 0x1
#define _I2C1PIE_RSCIE_LENGTH                               0x1
#define _I2C1PIE_RSCIE_MASK                                 0x2
#define _I2C1PIE_PCIE_POSN                                  0x2
#define _I2C1PIE_PCIE_POSITION                              0x2
#define _I2C1PIE_PCIE_SIZE                                  0x1
#define _I2C1PIE_PCIE_LENGTH                                0x1
#define _I2C1PIE_PCIE_MASK                                  0x4
#define _I2C1PIE_ADRIE_POSN                                 0x3
#define _I2C1PIE_ADRIE_POSITION                             0x3
#define _I2C1PIE_ADRIE_SIZE                                 0x1
#define _I2C1PIE_ADRIE_LENGTH                               0x1
#define _I2C1PIE_ADRIE_MASK                                 0x8
#define _I2C1PIE_WRIE_POSN                                  0x4
#define _I2C1PIE_WRIE_POSITION                              0x4
#define _I2C1PIE_WRIE_SIZE                                  0x1
#define _I2C1PIE_WRIE_LENGTH                                0x1
#define _I2C1PIE_WRIE_MASK                                  0x10
#define _I2C1PIE_ACKTIE_POSN                                0x6
#define _I2C1PIE_ACKTIE_POSITION                            0x6
#define _I2C1PIE_ACKTIE_SIZE                                0x1
#define _I2C1PIE_ACKTIE_LENGTH                              0x1
#define _I2C1PIE_ACKTIE_MASK                                0x40
#define _I2C1PIE_CNTIE_POSN                                 0x7
#define _I2C1PIE_CNTIE_POSITION                             0x7
#define _I2C1PIE_CNTIE_SIZE                                 0x1
#define _I2C1PIE_CNTIE_LENGTH                               0x1
#define _I2C1PIE_CNTIE_MASK                                 0x80
#define _I2C1PIE_SC1IE_POSN                                 0x0
#define _I2C1PIE_SC1IE_POSITION                             0x0
#define _I2C1PIE_SC1IE_SIZE                                 0x1
#define _I2C1PIE_SC1IE_LENGTH                               0x1
#define _I2C1PIE_SC1IE_MASK                                 0x1
#define _I2C1PIE_RSC1IE_POSN                                0x1
#define _I2C1PIE_RSC1IE_POSITION                            0x1
#define _I2C1PIE_RSC1IE_SIZE                                0x1
#define _I2C1PIE_RSC1IE_LENGTH                              0x1
#define _I2C1PIE_RSC1IE_MASK                                0x2
#define _I2C1PIE_PC1IE_POSN                                 0x2
#define _I2C1PIE_PC1IE_POSITION                             0x2
#define _I2C1PIE_PC1IE_SIZE                                 0x1
#define _I2C1PIE_PC1IE_LENGTH                               0x1
#define _I2C1PIE_PC1IE_MASK                                 0x4
#define _I2C1PIE_ADR1IE_POSN                                0x3
#define _I2C1PIE_ADR1IE_POSITION                            0x3
#define _I2C1PIE_ADR1IE_SIZE                                0x1
#define _I2C1PIE_ADR1IE_LENGTH                              0x1
#define _I2C1PIE_ADR1IE_MASK                                0x8
#define _I2C1PIE_WR1IE_POSN                                 0x4
#define _I2C1PIE_WR1IE_POSITION                             0x4
#define _I2C1PIE_WR1IE_SIZE                                 0x1
#define _I2C1PIE_WR1IE_LENGTH                               0x1
#define _I2C1PIE_WR1IE_MASK                                 0x10
#define _I2C1PIE_ACKT1IE_POSN                               0x6
#define _I2C1PIE_ACKT1IE_POSITION                           0x6
#define _I2C1PIE_ACKT1IE_SIZE                               0x1
#define _I2C1PIE_ACKT1IE_LENGTH                             0x1
#define _I2C1PIE_ACKT1IE_MASK                               0x40
#define _I2C1PIE_CNT1IE_POSN                                0x7
#define _I2C1PIE_CNT1IE_POSITION                            0x7
#define _I2C1PIE_CNT1IE_SIZE                                0x1
#define _I2C1PIE_CNT1IE_LENGTH                              0x1
#define _I2C1PIE_CNT1IE_MASK                                0x80

// Register: I2C1BTO
#define I2C1BTO I2C1BTO
extern volatile unsigned char           I2C1BTO             __at(0x29C);
#ifndef _LIB_BUILD
asm("I2C1BTO equ 029Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOTIME                 :6;
        unsigned TOBY32                 :1;
        unsigned TOREC                  :1;
    };
    struct {
        unsigned TOTIME0                :1;
        unsigned TOTIME1                :1;
        unsigned TOTIME2                :1;
        unsigned TOTIME3                :1;
        unsigned TOTIME4                :1;
        unsigned TOTIME5                :1;
    };
} I2C1BTObits_t;
extern volatile I2C1BTObits_t I2C1BTObits __at(0x29C);
// bitfield macros
#define _I2C1BTO_TOTIME_POSN                                0x0
#define _I2C1BTO_TOTIME_POSITION                            0x0
#define _I2C1BTO_TOTIME_SIZE                                0x6
#define _I2C1BTO_TOTIME_LENGTH                              0x6
#define _I2C1BTO_TOTIME_MASK                                0x3F
#define _I2C1BTO_TOBY32_POSN                                0x6
#define _I2C1BTO_TOBY32_POSITION                            0x6
#define _I2C1BTO_TOBY32_SIZE                                0x1
#define _I2C1BTO_TOBY32_LENGTH                              0x1
#define _I2C1BTO_TOBY32_MASK                                0x40
#define _I2C1BTO_TOREC_POSN                                 0x7
#define _I2C1BTO_TOREC_POSITION                             0x7
#define _I2C1BTO_TOREC_SIZE                                 0x1
#define _I2C1BTO_TOREC_LENGTH                               0x1
#define _I2C1BTO_TOREC_MASK                                 0x80
#define _I2C1BTO_TOTIME0_POSN                               0x0
#define _I2C1BTO_TOTIME0_POSITION                           0x0
#define _I2C1BTO_TOTIME0_SIZE                               0x1
#define _I2C1BTO_TOTIME0_LENGTH                             0x1
#define _I2C1BTO_TOTIME0_MASK                               0x1
#define _I2C1BTO_TOTIME1_POSN                               0x1
#define _I2C1BTO_TOTIME1_POSITION                           0x1
#define _I2C1BTO_TOTIME1_SIZE                               0x1
#define _I2C1BTO_TOTIME1_LENGTH                             0x1
#define _I2C1BTO_TOTIME1_MASK                               0x2
#define _I2C1BTO_TOTIME2_POSN                               0x2
#define _I2C1BTO_TOTIME2_POSITION                           0x2
#define _I2C1BTO_TOTIME2_SIZE                               0x1
#define _I2C1BTO_TOTIME2_LENGTH                             0x1
#define _I2C1BTO_TOTIME2_MASK                               0x4
#define _I2C1BTO_TOTIME3_POSN                               0x3
#define _I2C1BTO_TOTIME3_POSITION                           0x3
#define _I2C1BTO_TOTIME3_SIZE                               0x1
#define _I2C1BTO_TOTIME3_LENGTH                             0x1
#define _I2C1BTO_TOTIME3_MASK                               0x8
#define _I2C1BTO_TOTIME4_POSN                               0x4
#define _I2C1BTO_TOTIME4_POSITION                           0x4
#define _I2C1BTO_TOTIME4_SIZE                               0x1
#define _I2C1BTO_TOTIME4_LENGTH                             0x1
#define _I2C1BTO_TOTIME4_MASK                               0x10
#define _I2C1BTO_TOTIME5_POSN                               0x5
#define _I2C1BTO_TOTIME5_POSITION                           0x5
#define _I2C1BTO_TOTIME5_SIZE                               0x1
#define _I2C1BTO_TOTIME5_LENGTH                             0x1
#define _I2C1BTO_TOTIME5_MASK                               0x20

