GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.h
extern volatile U2ERRIEbits_t U2ERRIEbits __at(0x2C6);
// bitfield macros
#define _U2ERRIE_TXCIE_POSN                                 0x0
#define _U2ERRIE_TXCIE_POSITION                             0x0
#define _U2ERRIE_TXCIE_SIZE                                 0x1
#define _U2ERRIE_TXCIE_LENGTH                               0x1
#define _U2ERRIE_TXCIE_MASK                                 0x1
#define _U2ERRIE_RXFOIE_POSN                                0x1
#define _U2ERRIE_RXFOIE_POSITION                            0x1
#define _U2ERRIE_RXFOIE_SIZE                                0x1
#define _U2ERRIE_RXFOIE_LENGTH                              0x1
#define _U2ERRIE_RXFOIE_MASK                                0x2
#define _U2ERRIE_RXBKIE_POSN                                0x2
#define _U2ERRIE_RXBKIE_POSITION                            0x2
#define _U2ERRIE_RXBKIE_SIZE                                0x1
#define _U2ERRIE_RXBKIE_LENGTH                              0x1
#define _U2ERRIE_RXBKIE_MASK                                0x4
#define _U2ERRIE_FERIE_POSN                                 0x3
#define _U2ERRIE_FERIE_POSITION                             0x3
#define _U2ERRIE_FERIE_SIZE                                 0x1
#define _U2ERRIE_FERIE_LENGTH                               0x1
#define _U2ERRIE_FERIE_MASK                                 0x8
#define _U2ERRIE_CERIE_POSN                                 0x4
#define _U2ERRIE_CERIE_POSITION                             0x4
#define _U2ERRIE_CERIE_SIZE                                 0x1
#define _U2ERRIE_CERIE_LENGTH                               0x1
#define _U2ERRIE_CERIE_MASK                                 0x10
#define _U2ERRIE_ABDOVE_POSN                                0x5
#define _U2ERRIE_ABDOVE_POSITION                            0x5
#define _U2ERRIE_ABDOVE_SIZE                                0x1
#define _U2ERRIE_ABDOVE_LENGTH                              0x1
#define _U2ERRIE_ABDOVE_MASK                                0x20
#define _U2ERRIE_PERIE_POSN                                 0x6
#define _U2ERRIE_PERIE_POSITION                             0x6
#define _U2ERRIE_PERIE_SIZE                                 0x1
#define _U2ERRIE_PERIE_LENGTH                               0x1
#define _U2ERRIE_PERIE_MASK                                 0x40
#define _U2ERRIE_TXMTIE_POSN                                0x7
#define _U2ERRIE_TXMTIE_POSITION                            0x7
#define _U2ERRIE_TXMTIE_SIZE                                0x1
#define _U2ERRIE_TXMTIE_LENGTH                              0x1
#define _U2ERRIE_TXMTIE_MASK                                0x80
#define _U2ERRIE_U2TXCIE_POSN                               0x0
#define _U2ERRIE_U2TXCIE_POSITION                           0x0
#define _U2ERRIE_U2TXCIE_SIZE                               0x1
#define _U2ERRIE_U2TXCIE_LENGTH                             0x1
#define _U2ERRIE_U2TXCIE_MASK                               0x1
#define _U2ERRIE_U2RXFOIE_POSN                              0x1
#define _U2ERRIE_U2RXFOIE_POSITION                          0x1
#define _U2ERRIE_U2RXFOIE_SIZE                              0x1
#define _U2ERRIE_U2RXFOIE_LENGTH                            0x1
#define _U2ERRIE_U2RXFOIE_MASK                              0x2
#define _U2ERRIE_U2RXBKIE_POSN                              0x2
#define _U2ERRIE_U2RXBKIE_POSITION                          0x2
#define _U2ERRIE_U2RXBKIE_SIZE                              0x1
#define _U2ERRIE_U2RXBKIE_LENGTH                            0x1
#define _U2ERRIE_U2RXBKIE_MASK                              0x4
#define _U2ERRIE_U2FERIE_POSN                               0x3
#define _U2ERRIE_U2FERIE_POSITION                           0x3
#define _U2ERRIE_U2FERIE_SIZE                               0x1
#define _U2ERRIE_U2FERIE_LENGTH                             0x1
#define _U2ERRIE_U2FERIE_MASK                               0x8
#define _U2ERRIE_U2CERIE_POSN                               0x4
#define _U2ERRIE_U2CERIE_POSITION                           0x4
#define _U2ERRIE_U2CERIE_SIZE                               0x1
#define _U2ERRIE_U2CERIE_LENGTH                             0x1
#define _U2ERRIE_U2CERIE_MASK                               0x10
#define _U2ERRIE_U2ABDOVE_POSN                              0x5
#define _U2ERRIE_U2ABDOVE_POSITION                          0x5
#define _U2ERRIE_U2ABDOVE_SIZE                              0x1
#define _U2ERRIE_U2ABDOVE_LENGTH                            0x1
#define _U2ERRIE_U2ABDOVE_MASK                              0x20
#define _U2ERRIE_U2PERIE_POSN                               0x6
#define _U2ERRIE_U2PERIE_POSITION                           0x6
#define _U2ERRIE_U2PERIE_SIZE                               0x1
#define _U2ERRIE_U2PERIE_LENGTH                             0x1
#define _U2ERRIE_U2PERIE_MASK                               0x40
#define _U2ERRIE_U2TXMTIE_POSN                              0x7
#define _U2ERRIE_U2TXMTIE_POSITION                          0x7
#define _U2ERRIE_U2TXMTIE_SIZE                              0x1
#define _U2ERRIE_U2TXMTIE_LENGTH                            0x1
#define _U2ERRIE_U2TXMTIE_MASK                              0x80

// Register: U3RXB
#define U3RXB U3RXB
extern volatile unsigned char           U3RXB               __at(0x2C7);
#ifndef _LIB_BUILD
asm("U3RXB equ 02C7h");
#endif
// aliases
extern volatile unsigned char           U3RXBL              __at(0x2C7);
#ifndef _LIB_BUILD
asm("U3RXBL equ 02C7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U3RXBbits_t;
extern volatile U3RXBbits_t U3RXBbits __at(0x2C7);
// bitfield macros
#define _U3RXB_RXB_POSN                                     0x0
#define _U3RXB_RXB_POSITION                                 0x0
#define _U3RXB_RXB_SIZE                                     0x8
#define _U3RXB_RXB_LENGTH                                   0x8
#define _U3RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U3RXBLbits_t;
extern volatile U3RXBLbits_t U3RXBLbits __at(0x2C7);
// bitfield macros
#define _U3RXBL_RXB_POSN                                    0x0
#define _U3RXBL_RXB_POSITION                                0x0
#define _U3RXBL_RXB_SIZE                                    0x8
#define _U3RXBL_RXB_LENGTH                                  0x8
#define _U3RXBL_RXB_MASK                                    0xFF

// Register: U3TXB
#define U3TXB U3TXB
extern volatile unsigned char           U3TXB               __at(0x2C9);
#ifndef _LIB_BUILD
asm("U3TXB equ 02C9h");
#endif
// aliases
extern volatile unsigned char           U3TXBL              __at(0x2C9);
#ifndef _LIB_BUILD
asm("U3TXBL equ 02C9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U3TXBbits_t;
extern volatile U3TXBbits_t U3TXBbits __at(0x2C9);
// bitfield macros
#define _U3TXB_TXB_POSN                                     0x0
#define _U3TXB_TXB_POSITION                                 0x0
#define _U3TXB_TXB_SIZE                                     0x8
#define _U3TXB_TXB_LENGTH                                   0x8
#define _U3TXB_TXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U3TXBLbits_t;
extern volatile U3TXBLbits_t U3TXBLbits __at(0x2C9);
// bitfield macros
#define _U3TXBL_TXB_POSN                                    0x0
#define _U3TXBL_TXB_POSITION                                0x0
#define _U3TXBL_TXB_SIZE                                    0x8
#define _U3TXBL_TXB_LENGTH                                  0x8
#define _U3TXBL_TXB_MASK                                    0xFF

// Register: U3P1
#define U3P1 U3P1
extern volatile unsigned char           U3P1                __at(0x2CB);
#ifndef _LIB_BUILD
asm("U3P1 equ 02CBh");
#endif

// Register: U3P1L
#define U3P1L U3P1L
extern volatile unsigned char           U3P1L               __at(0x2CB);
#ifndef _LIB_BUILD
asm("U3P1L equ 02CBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U3P1Lbits_t;
extern volatile U3P1Lbits_t U3P1Lbits __at(0x2CB);
// bitfield macros
#define _U3P1L_P1L_POSN                                     0x0
#define _U3P1L_P1L_POSITION                                 0x0
#define _U3P1L_P1L_SIZE                                     0x8
#define _U3P1L_P1L_LENGTH                                   0x8
#define _U3P1L_P1L_MASK                                     0xFF

// Register: U3P2
#define U3P2 U3P2
extern volatile unsigned char           U3P2                __at(0x2CD);
#ifndef _LIB_BUILD
asm("U3P2 equ 02CDh");
#endif

// Register: U3P2L
#define U3P2L U3P2L
extern volatile unsigned char           U3P2L               __at(0x2CD);
#ifndef _LIB_BUILD
asm("U3P2L equ 02CDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U3P2Lbits_t;
extern volatile U3P2Lbits_t U3P2Lbits __at(0x2CD);
// bitfield macros
#define _U3P2L_P2L_POSN                                     0x0
#define _U3P2L_P2L_POSITION                                 0x0
#define _U3P2L_P2L_SIZE                                     0x8
#define _U3P2L_P2L_LENGTH                                   0x8
#define _U3P2L_P2L_MASK                                     0xFF

// Register: U3P3
#define U3P3 U3P3
extern volatile unsigned char           U3P3                __at(0x2CF);
#ifndef _LIB_BUILD
asm("U3P3 equ 02CFh");
#endif

