GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.h
// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x4AE);
#ifndef _LIB_BUILD
asm("PIE6 equ 04AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IE                 :1;
        unsigned                        :1;
        unsigned CWG1IE                 :1;
        unsigned NCO1IE                 :1;
        unsigned DMA2SCNTIE             :1;
        unsigned DMA2DCNTIE             :1;
        unsigned DMA2ORIE               :1;
        unsigned DMA2AIE                :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x4AE);
// bitfield macros
#define _PIE6_INT1IE_POSN                                   0x0
#define _PIE6_INT1IE_POSITION                               0x0
#define _PIE6_INT1IE_SIZE                                   0x1
#define _PIE6_INT1IE_LENGTH                                 0x1
#define _PIE6_INT1IE_MASK                                   0x1
#define _PIE6_CWG1IE_POSN                                   0x2
#define _PIE6_CWG1IE_POSITION                               0x2
#define _PIE6_CWG1IE_SIZE                                   0x1
#define _PIE6_CWG1IE_LENGTH                                 0x1
#define _PIE6_CWG1IE_MASK                                   0x4
#define _PIE6_NCO1IE_POSN                                   0x3
#define _PIE6_NCO1IE_POSITION                               0x3
#define _PIE6_NCO1IE_SIZE                                   0x1
#define _PIE6_NCO1IE_LENGTH                                 0x1
#define _PIE6_NCO1IE_MASK                                   0x8
#define _PIE6_DMA2SCNTIE_POSN                               0x4
#define _PIE6_DMA2SCNTIE_POSITION                           0x4
#define _PIE6_DMA2SCNTIE_SIZE                               0x1
#define _PIE6_DMA2SCNTIE_LENGTH                             0x1
#define _PIE6_DMA2SCNTIE_MASK                               0x10
#define _PIE6_DMA2DCNTIE_POSN                               0x5
#define _PIE6_DMA2DCNTIE_POSITION                           0x5
#define _PIE6_DMA2DCNTIE_SIZE                               0x1
#define _PIE6_DMA2DCNTIE_LENGTH                             0x1
#define _PIE6_DMA2DCNTIE_MASK                               0x20
#define _PIE6_DMA2ORIE_POSN                                 0x6
#define _PIE6_DMA2ORIE_POSITION                             0x6
#define _PIE6_DMA2ORIE_SIZE                                 0x1
#define _PIE6_DMA2ORIE_LENGTH                               0x1
#define _PIE6_DMA2ORIE_MASK                                 0x40
#define _PIE6_DMA2AIE_POSN                                  0x7
#define _PIE6_DMA2AIE_POSITION                              0x7
#define _PIE6_DMA2AIE_SIZE                                  0x1
#define _PIE6_DMA2AIE_LENGTH                                0x1
#define _PIE6_DMA2AIE_MASK                                  0x80

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x4AF);
#ifndef _LIB_BUILD
asm("PIE7 equ 04AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIE               :1;
        unsigned I2C1TXIE               :1;
        unsigned I2C1IE                 :1;
        unsigned I2C1EIE                :1;
        unsigned                        :1;
        unsigned CLC3IE                 :1;
        unsigned PWM3PIE                :1;
        unsigned PWM3IE                 :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x4AF);
// bitfield macros
#define _PIE7_I2C1RXIE_POSN                                 0x0
#define _PIE7_I2C1RXIE_POSITION                             0x0
#define _PIE7_I2C1RXIE_SIZE                                 0x1
#define _PIE7_I2C1RXIE_LENGTH                               0x1
#define _PIE7_I2C1RXIE_MASK                                 0x1
#define _PIE7_I2C1TXIE_POSN                                 0x1
#define _PIE7_I2C1TXIE_POSITION                             0x1
#define _PIE7_I2C1TXIE_SIZE                                 0x1
#define _PIE7_I2C1TXIE_LENGTH                               0x1
#define _PIE7_I2C1TXIE_MASK                                 0x2
#define _PIE7_I2C1IE_POSN                                   0x2
#define _PIE7_I2C1IE_POSITION                               0x2
#define _PIE7_I2C1IE_SIZE                                   0x1
#define _PIE7_I2C1IE_LENGTH                                 0x1
#define _PIE7_I2C1IE_MASK                                   0x4
#define _PIE7_I2C1EIE_POSN                                  0x3
#define _PIE7_I2C1EIE_POSITION                              0x3
#define _PIE7_I2C1EIE_SIZE                                  0x1
#define _PIE7_I2C1EIE_LENGTH                                0x1
#define _PIE7_I2C1EIE_MASK                                  0x8
#define _PIE7_CLC3IE_POSN                                   0x5
#define _PIE7_CLC3IE_POSITION                               0x5
#define _PIE7_CLC3IE_SIZE                                   0x1
#define _PIE7_CLC3IE_LENGTH                                 0x1
#define _PIE7_CLC3IE_MASK                                   0x20
#define _PIE7_PWM3PIE_POSN                                  0x6
#define _PIE7_PWM3PIE_POSITION                              0x6
#define _PIE7_PWM3PIE_SIZE                                  0x1
#define _PIE7_PWM3PIE_LENGTH                                0x1
#define _PIE7_PWM3PIE_MASK                                  0x40
#define _PIE7_PWM3IE_POSN                                   0x7
#define _PIE7_PWM3IE_POSITION                               0x7
#define _PIE7_PWM3IE_SIZE                                   0x1
#define _PIE7_PWM3IE_LENGTH                                 0x1
#define _PIE7_PWM3IE_MASK                                   0x80

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0x4B0);
#ifndef _LIB_BUILD
asm("PIE8 equ 04B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIE                 :1;
        unsigned U2TXIE                 :1;
        unsigned U2EIE                  :1;
        unsigned U2IE                   :1;
        unsigned                        :1;
        unsigned CLC4IE                 :1;
        unsigned                        :1;
        unsigned SCANIE                 :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0x4B0);
// bitfield macros
#define _PIE8_U2RXIE_POSN                                   0x0
#define _PIE8_U2RXIE_POSITION                               0x0
#define _PIE8_U2RXIE_SIZE                                   0x1
#define _PIE8_U2RXIE_LENGTH                                 0x1
#define _PIE8_U2RXIE_MASK                                   0x1
#define _PIE8_U2TXIE_POSN                                   0x1
#define _PIE8_U2TXIE_POSITION                               0x1
#define _PIE8_U2TXIE_SIZE                                   0x1
#define _PIE8_U2TXIE_LENGTH                                 0x1
#define _PIE8_U2TXIE_MASK                                   0x2
#define _PIE8_U2EIE_POSN                                    0x2
#define _PIE8_U2EIE_POSITION                                0x2
#define _PIE8_U2EIE_SIZE                                    0x1
#define _PIE8_U2EIE_LENGTH                                  0x1
#define _PIE8_U2EIE_MASK                                    0x4
#define _PIE8_U2IE_POSN                                     0x3
#define _PIE8_U2IE_POSITION                                 0x3
#define _PIE8_U2IE_SIZE                                     0x1
#define _PIE8_U2IE_LENGTH                                   0x1
#define _PIE8_U2IE_MASK                                     0x8
#define _PIE8_CLC4IE_POSN                                   0x5
#define _PIE8_CLC4IE_POSITION                               0x5
#define _PIE8_CLC4IE_SIZE                                   0x1
#define _PIE8_CLC4IE_LENGTH                                 0x1
#define _PIE8_CLC4IE_MASK                                   0x20
#define _PIE8_SCANIE_POSN                                   0x7
#define _PIE8_SCANIE_POSITION                               0x7
#define _PIE8_SCANIE_SIZE                                   0x1
#define _PIE8_SCANIE_LENGTH                                 0x1
#define _PIE8_SCANIE_MASK                                   0x80

// Register: PIE9
#define PIE9 PIE9
extern volatile unsigned char           PIE9                __at(0x4B1);
#ifndef _LIB_BUILD
asm("PIE9 equ 04B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U3RXIE                 :1;
        unsigned U3TXIE                 :1;
        unsigned U3EIE                  :1;
        unsigned U3IE                   :1;
        unsigned DMA3SCNTIE             :1;
        unsigned DMA3DCNTIE             :1;
        unsigned DMA3ORIE               :1;
        unsigned DMA3AIE                :1;
    };
} PIE9bits_t;
extern volatile PIE9bits_t PIE9bits __at(0x4B1);
// bitfield macros
#define _PIE9_U3RXIE_POSN                                   0x0
#define _PIE9_U3RXIE_POSITION                               0x0
#define _PIE9_U3RXIE_SIZE                                   0x1
#define _PIE9_U3RXIE_LENGTH                                 0x1
#define _PIE9_U3RXIE_MASK                                   0x1
#define _PIE9_U3TXIE_POSN                                   0x1
#define _PIE9_U3TXIE_POSITION                               0x1
#define _PIE9_U3TXIE_SIZE                                   0x1
#define _PIE9_U3TXIE_LENGTH                                 0x1
#define _PIE9_U3TXIE_MASK                                   0x2
#define _PIE9_U3EIE_POSN                                    0x2
#define _PIE9_U3EIE_POSITION                                0x2
#define _PIE9_U3EIE_SIZE                                    0x1
#define _PIE9_U3EIE_LENGTH                                  0x1
#define _PIE9_U3EIE_MASK                                    0x4
#define _PIE9_U3IE_POSN                                     0x3
#define _PIE9_U3IE_POSITION                                 0x3
#define _PIE9_U3IE_SIZE                                     0x1
#define _PIE9_U3IE_LENGTH                                   0x1
#define _PIE9_U3IE_MASK                                     0x8
#define _PIE9_DMA3SCNTIE_POSN                               0x4
#define _PIE9_DMA3SCNTIE_POSITION                           0x4
#define _PIE9_DMA3SCNTIE_SIZE                               0x1
#define _PIE9_DMA3SCNTIE_LENGTH                             0x1
#define _PIE9_DMA3SCNTIE_MASK                               0x10
#define _PIE9_DMA3DCNTIE_POSN                               0x5
#define _PIE9_DMA3DCNTIE_POSITION                           0x5
#define _PIE9_DMA3DCNTIE_SIZE                               0x1
#define _PIE9_DMA3DCNTIE_LENGTH                             0x1
#define _PIE9_DMA3DCNTIE_MASK                               0x20
#define _PIE9_DMA3ORIE_POSN                                 0x6
#define _PIE9_DMA3ORIE_POSITION                             0x6
#define _PIE9_DMA3ORIE_SIZE                                 0x1
#define _PIE9_DMA3ORIE_LENGTH                               0x1
#define _PIE9_DMA3ORIE_MASK                                 0x40
#define _PIE9_DMA3AIE_POSN                                  0x7
#define _PIE9_DMA3AIE_POSITION                              0x7
#define _PIE9_DMA3AIE_SIZE                                  0x1
#define _PIE9_DMA3AIE_LENGTH                                0x1
#define _PIE9_DMA3AIE_MASK                                  0x80

// Register: PIE10
#define PIE10 PIE10
extern volatile unsigned char           PIE10               __at(0x4B2);
#ifndef _LIB_BUILD
asm("PIE10 equ 04B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IE                 :1;
        unsigned                        :2;
        unsigned TMR4IE                 :1;
        unsigned DMA4SCNTIE             :1;
        unsigned DMA4DCNTIE             :1;
        unsigned DMA4ORIE               :1;
        unsigned DMA4AIE                :1;
    };
} PIE10bits_t;
extern volatile PIE10bits_t PIE10bits __at(0x4B2);
// bitfield macros
#define _PIE10_INT2IE_POSN                                  0x0
#define _PIE10_INT2IE_POSITION                              0x0
#define _PIE10_INT2IE_SIZE                                  0x1
#define _PIE10_INT2IE_LENGTH                                0x1
#define _PIE10_INT2IE_MASK                                  0x1
#define _PIE10_TMR4IE_POSN                                  0x3
#define _PIE10_TMR4IE_POSITION                              0x3
#define _PIE10_TMR4IE_SIZE                                  0x1
#define _PIE10_TMR4IE_LENGTH                                0x1
#define _PIE10_TMR4IE_MASK                                  0x8
#define _PIE10_DMA4SCNTIE_POSN                              0x4
#define _PIE10_DMA4SCNTIE_POSITION                          0x4
#define _PIE10_DMA4SCNTIE_SIZE                              0x1
#define _PIE10_DMA4SCNTIE_LENGTH                            0x1
#define _PIE10_DMA4SCNTIE_MASK                              0x10
#define _PIE10_DMA4DCNTIE_POSN                              0x5
#define _PIE10_DMA4DCNTIE_POSITION                          0x5
#define _PIE10_DMA4DCNTIE_SIZE                              0x1
#define _PIE10_DMA4DCNTIE_LENGTH                            0x1
#define _PIE10_DMA4DCNTIE_MASK                              0x20
#define _PIE10_DMA4ORIE_POSN                                0x6
#define _PIE10_DMA4ORIE_POSITION                            0x6
#define _PIE10_DMA4ORIE_SIZE                                0x1
#define _PIE10_DMA4ORIE_LENGTH                              0x1
#define _PIE10_DMA4ORIE_MASK                                0x40
#define _PIE10_DMA4AIE_POSN                                 0x7
#define _PIE10_DMA4AIE_POSITION                             0x7
#define _PIE10_DMA4AIE_SIZE                                 0x1
#define _PIE10_DMA4AIE_LENGTH                               0x1
#define _PIE10_DMA4AIE_MASK                                 0x80

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x4B3);
#ifndef _LIB_BUILD
asm("PIR0 equ 04B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIF                   :1;
        unsigned HLVDIF                 :1;
        unsigned OSFIF                  :1;
        unsigned CSWIF                  :1;
        unsigned NVMIF                  :1;
        unsigned CLC1IF                 :1;
        unsigned CRCIF                  :1;
        unsigned IOCIF                  :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x4B3);
// bitfield macros
#define _PIR0_SWIF_POSN                                     0x0
#define _PIR0_SWIF_POSITION                                 0x0
#define _PIR0_SWIF_SIZE                                     0x1
#define _PIR0_SWIF_LENGTH                                   0x1
#define _PIR0_SWIF_MASK                                     0x1
#define _PIR0_HLVDIF_POSN                                   0x1
#define _PIR0_HLVDIF_POSITION                               0x1
#define _PIR0_HLVDIF_SIZE                                   0x1
#define _PIR0_HLVDIF_LENGTH                                 0x1
#define _PIR0_HLVDIF_MASK                                   0x2
#define _PIR0_OSFIF_POSN                                    0x2
#define _PIR0_OSFIF_POSITION                                0x2
#define _PIR0_OSFIF_SIZE                                    0x1
#define _PIR0_OSFIF_LENGTH                                  0x1
#define _PIR0_OSFIF_MASK                                    0x4
#define _PIR0_CSWIF_POSN                                    0x3
#define _PIR0_CSWIF_POSITION                                0x3
#define _PIR0_CSWIF_SIZE                                    0x1
#define _PIR0_CSWIF_LENGTH                                  0x1
#define _PIR0_CSWIF_MASK                                    0x8
#define _PIR0_NVMIF_POSN                                    0x4
#define _PIR0_NVMIF_POSITION                                0x4
#define _PIR0_NVMIF_SIZE                                    0x1
#define _PIR0_NVMIF_LENGTH                                  0x1
#define _PIR0_NVMIF_MASK                                    0x10
#define _PIR0_CLC1IF_POSN                                   0x5
#define _PIR0_CLC1IF_POSITION                               0x5
#define _PIR0_CLC1IF_SIZE                                   0x1
#define _PIR0_CLC1IF_LENGTH                                 0x1
#define _PIR0_CLC1IF_MASK                                   0x20
#define _PIR0_CRCIF_POSN                                    0x6
#define _PIR0_CRCIF_POSITION                                0x6
#define _PIR0_CRCIF_SIZE                                    0x1
#define _PIR0_CRCIF_LENGTH                                  0x1
#define _PIR0_CRCIF_MASK                                    0x40
#define _PIR0_IOCIF_POSN                                    0x7
#define _PIR0_IOCIF_POSITION                                0x7
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x80

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x4B4);
#ifndef _LIB_BUILD
asm("PIR1 equ 04B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned ZCDIF                  :1;
        unsigned ADIF                   :1;
        unsigned ACTIF                  :1;
        unsigned C1IF                   :1;
        unsigned SMT1IF                 :1;
        unsigned SMT1PRAIF              :1;
        unsigned SMT1PWAIF              :1;
    };
    struct {
        unsigned                        :4;
        unsigned CM1IF                  :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x4B4);
// bitfield macros
#define _PIR1_INT0IF_POSN                                   0x0
#define _PIR1_INT0IF_POSITION                               0x0
#define _PIR1_INT0IF_SIZE                                   0x1
#define _PIR1_INT0IF_LENGTH                                 0x1
#define _PIR1_INT0IF_MASK                                   0x1
#define _PIR1_ZCDIF_POSN                                    0x1
#define _PIR1_ZCDIF_POSITION                                0x1
#define _PIR1_ZCDIF_SIZE                                    0x1
#define _PIR1_ZCDIF_LENGTH                                  0x1
#define _PIR1_ZCDIF_MASK                                    0x2
#define _PIR1_ADIF_POSN                                     0x2
#define _PIR1_ADIF_POSITION                                 0x2
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x4
#define _PIR1_ACTIF_POSN                                    0x3
#define _PIR1_ACTIF_POSITION                                0x3
#define _PIR1_ACTIF_SIZE                                    0x1
#define _PIR1_ACTIF_LENGTH                                  0x1
#define _PIR1_ACTIF_MASK                                    0x8
#define _PIR1_C1IF_POSN                                     0x4
#define _PIR1_C1IF_POSITION                                 0x4
#define _PIR1_C1IF_SIZE                                     0x1
#define _PIR1_C1IF_LENGTH                                   0x1
#define _PIR1_C1IF_MASK                                     0x10
#define _PIR1_SMT1IF_POSN                                   0x5
#define _PIR1_SMT1IF_POSITION                               0x5
#define _PIR1_SMT1IF_SIZE                                   0x1
#define _PIR1_SMT1IF_LENGTH                                 0x1
#define _PIR1_SMT1IF_MASK                                   0x20
#define _PIR1_SMT1PRAIF_POSN                                0x6
#define _PIR1_SMT1PRAIF_POSITION                            0x6
#define _PIR1_SMT1PRAIF_SIZE                                0x1
#define _PIR1_SMT1PRAIF_LENGTH                              0x1
#define _PIR1_SMT1PRAIF_MASK                                0x40
#define _PIR1_SMT1PWAIF_POSN                                0x7
#define _PIR1_SMT1PWAIF_POSITION                            0x7
#define _PIR1_SMT1PWAIF_SIZE                                0x1
#define _PIR1_SMT1PWAIF_LENGTH                              0x1
#define _PIR1_SMT1PWAIF_MASK                                0x80
#define _PIR1_CM1IF_POSN                                    0x4
#define _PIR1_CM1IF_POSITION                                0x4
#define _PIR1_CM1IF_SIZE                                    0x1
#define _PIR1_CM1IF_LENGTH                                  0x1
#define _PIR1_CM1IF_MASK                                    0x10

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x4B5);
#ifndef _LIB_BUILD
asm("PIR2 equ 04B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADTIF                  :1;
        unsigned                        :3;
        unsigned DMA1SCNTIF             :1;
        unsigned DMA1DCNTIF             :1;
        unsigned DMA1ORIF               :1;
        unsigned DMA1AIF                :1;
    };
} PIR2bits_t;
