GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.h
extern volatile __bit                   PWM1PIF             __at(0x25BE);	// @ (0x4B7 * 8 + 6)
#define                                 PWM1PIF_bit         _BIT_ACCESS(PIR4,6)
// IPR4<PWM1PIP>
extern volatile __bit                   PWM1PIP             __at(0x1B5E);	// @ (0x36B * 8 + 6)
#define                                 PWM1PIP_bit         _BIT_ACCESS(IPR4,6)
// PWM2ERSPPS<PWM2ERSPPS0>
extern volatile __bit                   PWM2ERSPPS0         __at(0x1290);	// @ (0x252 * 8 + 0)
#define                                 PWM2ERSPPS0_bit     _BIT_ACCESS(PWM2ERSPPS,0)
// PWM2ERSPPS<PWM2ERSPPS1>
extern volatile __bit                   PWM2ERSPPS1         __at(0x1291);	// @ (0x252 * 8 + 1)
#define                                 PWM2ERSPPS1_bit     _BIT_ACCESS(PWM2ERSPPS,1)
// PWM2ERSPPS<PWM2ERSPPS2>
extern volatile __bit                   PWM2ERSPPS2         __at(0x1292);	// @ (0x252 * 8 + 2)
#define                                 PWM2ERSPPS2_bit     _BIT_ACCESS(PWM2ERSPPS,2)
// PWM2ERSPPS<PWM2ERSPPS3>
extern volatile __bit                   PWM2ERSPPS3         __at(0x1293);	// @ (0x252 * 8 + 3)
#define                                 PWM2ERSPPS3_bit     _BIT_ACCESS(PWM2ERSPPS,3)
// PWM2ERSPPS<PWM2ERSPPS4>
extern volatile __bit                   PWM2ERSPPS4         __at(0x1294);	// @ (0x252 * 8 + 4)
#define                                 PWM2ERSPPS4_bit     _BIT_ACCESS(PWM2ERSPPS,4)
// PWM2ERSPPS<PWM2ERSPPS5>
extern volatile __bit                   PWM2ERSPPS5         __at(0x1295);	// @ (0x252 * 8 + 5)
#define                                 PWM2ERSPPS5_bit     _BIT_ACCESS(PWM2ERSPPS,5)
// PIE5<PWM2IE>
extern volatile __bit                   PWM2IE              __at(0x256F);	// @ (0x4AD * 8 + 7)
#define                                 PWM2IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<PWM2IF>
extern volatile __bit                   PWM2IF              __at(0x25C7);	// @ (0x4B8 * 8 + 7)
#define                                 PWM2IF_bit          _BIT_ACCESS(PIR5,7)
// IPR5<PWM2IP>
extern volatile __bit                   PWM2IP              __at(0x1B67);	// @ (0x36C * 8 + 7)
#define                                 PWM2IP_bit          _BIT_ACCESS(IPR5,7)
// PMD3<PWM2MD>
extern volatile __bit                   PWM2MD              __at(0x331);	// @ (0x66 * 8 + 1)
#define                                 PWM2MD_bit          _BIT_ACCESS(PMD3,1)
// PIE5<PWM2PIE>
extern volatile __bit                   PWM2PIE             __at(0x256E);	// @ (0x4AD * 8 + 6)
#define                                 PWM2PIE_bit         _BIT_ACCESS(PIE5,6)
// PIR5<PWM2PIF>
extern volatile __bit                   PWM2PIF             __at(0x25C6);	// @ (0x4B8 * 8 + 6)
#define                                 PWM2PIF_bit         _BIT_ACCESS(PIR5,6)
// IPR5<PWM2PIP>
extern volatile __bit                   PWM2PIP             __at(0x1B66);	// @ (0x36C * 8 + 6)
#define                                 PWM2PIP_bit         _BIT_ACCESS(IPR5,6)
// PWM3ERSPPS<PWM3ERSPPS0>
extern volatile __bit                   PWM3ERSPPS0         __at(0x1298);	// @ (0x253 * 8 + 0)
#define                                 PWM3ERSPPS0_bit     _BIT_ACCESS(PWM3ERSPPS,0)
// PWM3ERSPPS<PWM3ERSPPS1>
extern volatile __bit                   PWM3ERSPPS1         __at(0x1299);	// @ (0x253 * 8 + 1)
#define                                 PWM3ERSPPS1_bit     _BIT_ACCESS(PWM3ERSPPS,1)
// PWM3ERSPPS<PWM3ERSPPS2>
extern volatile __bit                   PWM3ERSPPS2         __at(0x129A);	// @ (0x253 * 8 + 2)
#define                                 PWM3ERSPPS2_bit     _BIT_ACCESS(PWM3ERSPPS,2)
// PWM3ERSPPS<PWM3ERSPPS3>
extern volatile __bit                   PWM3ERSPPS3         __at(0x129B);	// @ (0x253 * 8 + 3)
#define                                 PWM3ERSPPS3_bit     _BIT_ACCESS(PWM3ERSPPS,3)
// PWM3ERSPPS<PWM3ERSPPS4>
extern volatile __bit                   PWM3ERSPPS4         __at(0x129C);	// @ (0x253 * 8 + 4)
#define                                 PWM3ERSPPS4_bit     _BIT_ACCESS(PWM3ERSPPS,4)
// PWM3ERSPPS<PWM3ERSPPS5>
extern volatile __bit                   PWM3ERSPPS5         __at(0x129D);	// @ (0x253 * 8 + 5)
#define                                 PWM3ERSPPS5_bit     _BIT_ACCESS(PWM3ERSPPS,5)
// PIE7<PWM3IE>
extern volatile __bit                   PWM3IE              __at(0x257F);	// @ (0x4AF * 8 + 7)
#define                                 PWM3IE_bit          _BIT_ACCESS(PIE7,7)
// PIR7<PWM3IF>
extern volatile __bit                   PWM3IF              __at(0x25D7);	// @ (0x4BA * 8 + 7)
#define                                 PWM3IF_bit          _BIT_ACCESS(PIR7,7)
// IPR7<PWM3IP>
extern volatile __bit                   PWM3IP              __at(0x1B77);	// @ (0x36E * 8 + 7)
#define                                 PWM3IP_bit          _BIT_ACCESS(IPR7,7)
// PMD3<PWM3MD>
extern volatile __bit                   PWM3MD              __at(0x332);	// @ (0x66 * 8 + 2)
#define                                 PWM3MD_bit          _BIT_ACCESS(PMD3,2)
// PIE7<PWM3PIE>
extern volatile __bit                   PWM3PIE             __at(0x257E);	// @ (0x4AF * 8 + 6)
#define                                 PWM3PIE_bit         _BIT_ACCESS(PIE7,6)
// PIR7<PWM3PIF>
extern volatile __bit                   PWM3PIF             __at(0x25D6);	// @ (0x4BA * 8 + 6)
#define                                 PWM3PIF_bit         _BIT_ACCESS(PIR7,6)
// IPR7<PWM3PIP>
extern volatile __bit                   PWM3PIP             __at(0x1B76);	// @ (0x36E * 8 + 6)
#define                                 PWM3PIP_bit         _BIT_ACCESS(IPR7,6)
// PWMIN0PPS<PWMIN0PPS0>
extern volatile __bit                   PWMIN0PPS0          __at(0x12B8);	// @ (0x257 * 8 + 0)
#define                                 PWMIN0PPS0_bit      _BIT_ACCESS(PWMIN0PPS,0)
// PWMIN0PPS<PWMIN0PPS1>
extern volatile __bit                   PWMIN0PPS1          __at(0x12B9);	// @ (0x257 * 8 + 1)
#define                                 PWMIN0PPS1_bit      _BIT_ACCESS(PWMIN0PPS,1)
// PWMIN0PPS<PWMIN0PPS2>
extern volatile __bit                   PWMIN0PPS2          __at(0x12BA);	// @ (0x257 * 8 + 2)
#define                                 PWMIN0PPS2_bit      _BIT_ACCESS(PWMIN0PPS,2)
// PWMIN0PPS<PWMIN0PPS3>
extern volatile __bit                   PWMIN0PPS3          __at(0x12BB);	// @ (0x257 * 8 + 3)
#define                                 PWMIN0PPS3_bit      _BIT_ACCESS(PWMIN0PPS,3)
// PWMIN0PPS<PWMIN0PPS4>
extern volatile __bit                   PWMIN0PPS4          __at(0x12BC);	// @ (0x257 * 8 + 4)
#define                                 PWMIN0PPS4_bit      _BIT_ACCESS(PWMIN0PPS,4)
// PWMIN0PPS<PWMIN0PPS5>
extern volatile __bit                   PWMIN0PPS5          __at(0x12BD);	// @ (0x257 * 8 + 5)
#define                                 PWMIN0PPS5_bit      _BIT_ACCESS(PWMIN0PPS,5)
// PWMIN1PPS<PWMIN1PPS0>
extern volatile __bit                   PWMIN1PPS0          __at(0x12C0);	// @ (0x258 * 8 + 0)
#define                                 PWMIN1PPS0_bit      _BIT_ACCESS(PWMIN1PPS,0)
// PWMIN1PPS<PWMIN1PPS1>
extern volatile __bit                   PWMIN1PPS1          __at(0x12C1);	// @ (0x258 * 8 + 1)
#define                                 PWMIN1PPS1_bit      _BIT_ACCESS(PWMIN1PPS,1)
// PWMIN1PPS<PWMIN1PPS2>
extern volatile __bit                   PWMIN1PPS2          __at(0x12C2);	// @ (0x258 * 8 + 2)
#define                                 PWMIN1PPS2_bit      _BIT_ACCESS(PWMIN1PPS,2)
// PWMIN1PPS<PWMIN1PPS3>
extern volatile __bit                   PWMIN1PPS3          __at(0x12C3);	// @ (0x258 * 8 + 3)
#define                                 PWMIN1PPS3_bit      _BIT_ACCESS(PWMIN1PPS,3)
// PWMIN1PPS<PWMIN1PPS4>
extern volatile __bit                   PWMIN1PPS4          __at(0x12C4);	// @ (0x258 * 8 + 4)
#define                                 PWMIN1PPS4_bit      _BIT_ACCESS(PWMIN1PPS,4)
// PWMIN1PPS<PWMIN1PPS5>
extern volatile __bit                   PWMIN1PPS5          __at(0x12C5);	// @ (0x258 * 8 + 5)
#define                                 PWMIN1PPS5_bit      _BIT_ACCESS(PWMIN1PPS,5)
// NCO1CLK<PWS0>
extern volatile __bit                   PWS0                __at(0x223D);	// @ (0x447 * 8 + 5)
#define                                 PWS0_bit            _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<PWS1>
extern volatile __bit                   PWS1                __at(0x223E);	// @ (0x447 * 8 + 6)
#define                                 PWS1_bit            _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<PWS2>
extern volatile __bit                   PWS2                __at(0x223F);	// @ (0x447 * 8 + 7)
#define                                 PWS2_bit            _BIT_ACCESS(NCO1CLK,7)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x2670);	// @ (0x4CE * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x1008);	// @ (0x201 * 8 + 0)
#define                                 RA0PPS0_bit         _BIT_ACCESS(RA0PPS,0)
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x1009);	// @ (0x201 * 8 + 1)
#define                                 RA0PPS1_bit         _BIT_ACCESS(RA0PPS,1)
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x100A);	// @ (0x201 * 8 + 2)
#define                                 RA0PPS2_bit         _BIT_ACCESS(RA0PPS,2)
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x100B);	// @ (0x201 * 8 + 3)
#define                                 RA0PPS3_bit         _BIT_ACCESS(RA0PPS,3)
// RA0PPS<RA0PPS4>
extern volatile __bit                   RA0PPS4             __at(0x100C);	// @ (0x201 * 8 + 4)
#define                                 RA0PPS4_bit         _BIT_ACCESS(RA0PPS,4)
// RA0PPS<RA0PPS5>
extern volatile __bit                   RA0PPS5             __at(0x100D);	// @ (0x201 * 8 + 5)
#define                                 RA0PPS5_bit         _BIT_ACCESS(RA0PPS,5)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x2671);	// @ (0x4CE * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// RA1PPS<RA1PPS0>
extern volatile __bit                   RA1PPS0             __at(0x1010);	// @ (0x202 * 8 + 0)
#define                                 RA1PPS0_bit         _BIT_ACCESS(RA1PPS,0)
// RA1PPS<RA1PPS1>
extern volatile __bit                   RA1PPS1             __at(0x1011);	// @ (0x202 * 8 + 1)
#define                                 RA1PPS1_bit         _BIT_ACCESS(RA1PPS,1)
// RA1PPS<RA1PPS2>
extern volatile __bit                   RA1PPS2             __at(0x1012);	// @ (0x202 * 8 + 2)
#define                                 RA1PPS2_bit         _BIT_ACCESS(RA1PPS,2)
// RA1PPS<RA1PPS3>
extern volatile __bit                   RA1PPS3             __at(0x1013);	// @ (0x202 * 8 + 3)
#define                                 RA1PPS3_bit         _BIT_ACCESS(RA1PPS,3)
// RA1PPS<RA1PPS4>
extern volatile __bit                   RA1PPS4             __at(0x1014);	// @ (0x202 * 8 + 4)
#define                                 RA1PPS4_bit         _BIT_ACCESS(RA1PPS,4)
// RA1PPS<RA1PPS5>
extern volatile __bit                   RA1PPS5             __at(0x1015);	// @ (0x202 * 8 + 5)
#define                                 RA1PPS5_bit         _BIT_ACCESS(RA1PPS,5)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x2672);	// @ (0x4CE * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// RA2PPS<RA2PPS0>
extern volatile __bit                   RA2PPS0             __at(0x1018);	// @ (0x203 * 8 + 0)
#define                                 RA2PPS0_bit         _BIT_ACCESS(RA2PPS,0)
// RA2PPS<RA2PPS1>
extern volatile __bit                   RA2PPS1             __at(0x1019);	// @ (0x203 * 8 + 1)
#define                                 RA2PPS1_bit         _BIT_ACCESS(RA2PPS,1)
// RA2PPS<RA2PPS2>
extern volatile __bit                   RA2PPS2             __at(0x101A);	// @ (0x203 * 8 + 2)
#define                                 RA2PPS2_bit         _BIT_ACCESS(RA2PPS,2)
// RA2PPS<RA2PPS3>
extern volatile __bit                   RA2PPS3             __at(0x101B);	// @ (0x203 * 8 + 3)
#define                                 RA2PPS3_bit         _BIT_ACCESS(RA2PPS,3)
// RA2PPS<RA2PPS4>
extern volatile __bit                   RA2PPS4             __at(0x101C);	// @ (0x203 * 8 + 4)
#define                                 RA2PPS4_bit         _BIT_ACCESS(RA2PPS,4)
// RA2PPS<RA2PPS5>
extern volatile __bit                   RA2PPS5             __at(0x101D);	// @ (0x203 * 8 + 5)
#define                                 RA2PPS5_bit         _BIT_ACCESS(RA2PPS,5)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x2673);	// @ (0x4CE * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x2674);	// @ (0x4CE * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// RA4PPS<RA4PPS0>
extern volatile __bit                   RA4PPS0             __at(0x1028);	// @ (0x205 * 8 + 0)
#define                                 RA4PPS0_bit         _BIT_ACCESS(RA4PPS,0)
// RA4PPS<RA4PPS1>
extern volatile __bit                   RA4PPS1             __at(0x1029);	// @ (0x205 * 8 + 1)
#define                                 RA4PPS1_bit         _BIT_ACCESS(RA4PPS,1)
// RA4PPS<RA4PPS2>
extern volatile __bit                   RA4PPS2             __at(0x102A);	// @ (0x205 * 8 + 2)
#define                                 RA4PPS2_bit         _BIT_ACCESS(RA4PPS,2)
// RA4PPS<RA4PPS3>
extern volatile __bit                   RA4PPS3             __at(0x102B);	// @ (0x205 * 8 + 3)
#define                                 RA4PPS3_bit         _BIT_ACCESS(RA4PPS,3)
// RA4PPS<RA4PPS4>
extern volatile __bit                   RA4PPS4             __at(0x102C);	// @ (0x205 * 8 + 4)
#define                                 RA4PPS4_bit         _BIT_ACCESS(RA4PPS,4)
// RA4PPS<RA4PPS5>
extern volatile __bit                   RA4PPS5             __at(0x102D);	// @ (0x205 * 8 + 5)
#define                                 RA4PPS5_bit         _BIT_ACCESS(RA4PPS,5)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x2675);	// @ (0x4CE * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// RA5PPS<RA5PPS0>
extern volatile __bit                   RA5PPS0             __at(0x1030);	// @ (0x206 * 8 + 0)
#define                                 RA5PPS0_bit         _BIT_ACCESS(RA5PPS,0)
// RA5PPS<RA5PPS1>
extern volatile __bit                   RA5PPS1             __at(0x1031);	// @ (0x206 * 8 + 1)
#define                                 RA5PPS1_bit         _BIT_ACCESS(RA5PPS,1)
// RA5PPS<RA5PPS2>
extern volatile __bit                   RA5PPS2             __at(0x1032);	// @ (0x206 * 8 + 2)
#define                                 RA5PPS2_bit         _BIT_ACCESS(RA5PPS,2)
// RA5PPS<RA5PPS3>
extern volatile __bit                   RA5PPS3             __at(0x1033);	// @ (0x206 * 8 + 3)
#define                                 RA5PPS3_bit         _BIT_ACCESS(RA5PPS,3)
// RA5PPS<RA5PPS4>
extern volatile __bit                   RA5PPS4             __at(0x1034);	// @ (0x206 * 8 + 4)
#define                                 RA5PPS4_bit         _BIT_ACCESS(RA5PPS,4)
// RA5PPS<RA5PPS5>
extern volatile __bit                   RA5PPS5             __at(0x1035);	// @ (0x206 * 8 + 5)
#define                                 RA5PPS5_bit         _BIT_ACCESS(RA5PPS,5)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x267C);	// @ (0x4CF * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// RB4PPS<RB4PPS0>
extern volatile __bit                   RB4PPS0             __at(0x1068);	// @ (0x20D * 8 + 0)
#define                                 RB4PPS0_bit         _BIT_ACCESS(RB4PPS,0)
// RB4PPS<RB4PPS1>
extern volatile __bit                   RB4PPS1             __at(0x1069);	// @ (0x20D * 8 + 1)
#define                                 RB4PPS1_bit         _BIT_ACCESS(RB4PPS,1)
// RB4PPS<RB4PPS2>
extern volatile __bit                   RB4PPS2             __at(0x106A);	// @ (0x20D * 8 + 2)
#define                                 RB4PPS2_bit         _BIT_ACCESS(RB4PPS,2)
// RB4PPS<RB4PPS3>
extern volatile __bit                   RB4PPS3             __at(0x106B);	// @ (0x20D * 8 + 3)
#define                                 RB4PPS3_bit         _BIT_ACCESS(RB4PPS,3)
// RB4PPS<RB4PPS4>
extern volatile __bit                   RB4PPS4             __at(0x106C);	// @ (0x20D * 8 + 4)
#define                                 RB4PPS4_bit         _BIT_ACCESS(RB4PPS,4)
// RB4PPS<RB4PPS5>
extern volatile __bit                   RB4PPS5             __at(0x106D);	// @ (0x20D * 8 + 5)
#define                                 RB4PPS5_bit         _BIT_ACCESS(RB4PPS,5)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x267D);	// @ (0x4CF * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// RB5PPS<RB5PPS0>
extern volatile __bit                   RB5PPS0             __at(0x1070);	// @ (0x20E * 8 + 0)
#define                                 RB5PPS0_bit         _BIT_ACCESS(RB5PPS,0)
// RB5PPS<RB5PPS1>
extern volatile __bit                   RB5PPS1             __at(0x1071);	// @ (0x20E * 8 + 1)
#define                                 RB5PPS1_bit         _BIT_ACCESS(RB5PPS,1)
// RB5PPS<RB5PPS2>
extern volatile __bit                   RB5PPS2             __at(0x1072);	// @ (0x20E * 8 + 2)
#define                                 RB5PPS2_bit         _BIT_ACCESS(RB5PPS,2)
// RB5PPS<RB5PPS3>
extern volatile __bit                   RB5PPS3             __at(0x1073);	// @ (0x20E * 8 + 3)
#define                                 RB5PPS3_bit         _BIT_ACCESS(RB5PPS,3)
// RB5PPS<RB5PPS4>
extern volatile __bit                   RB5PPS4             __at(0x1074);	// @ (0x20E * 8 + 4)
#define                                 RB5PPS4_bit         _BIT_ACCESS(RB5PPS,4)
// RB5PPS<RB5PPS5>
extern volatile __bit                   RB5PPS5             __at(0x1075);	// @ (0x20E * 8 + 5)
#define                                 RB5PPS5_bit         _BIT_ACCESS(RB5PPS,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x267E);	// @ (0x4CF * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// RB6PPS<RB6PPS0>
extern volatile __bit                   RB6PPS0             __at(0x1078);	// @ (0x20F * 8 + 0)
#define                                 RB6PPS0_bit         _BIT_ACCESS(RB6PPS,0)
// RB6PPS<RB6PPS1>
extern volatile __bit                   RB6PPS1             __at(0x1079);	// @ (0x20F * 8 + 1)
#define                                 RB6PPS1_bit         _BIT_ACCESS(RB6PPS,1)
// RB6PPS<RB6PPS2>
extern volatile __bit                   RB6PPS2             __at(0x107A);	// @ (0x20F * 8 + 2)
#define                                 RB6PPS2_bit         _BIT_ACCESS(RB6PPS,2)
// RB6PPS<RB6PPS3>
extern volatile __bit                   RB6PPS3             __at(0x107B);	// @ (0x20F * 8 + 3)
#define                                 RB6PPS3_bit         _BIT_ACCESS(RB6PPS,3)
// RB6PPS<RB6PPS4>
extern volatile __bit                   RB6PPS4             __at(0x107C);	// @ (0x20F * 8 + 4)
#define                                 RB6PPS4_bit         _BIT_ACCESS(RB6PPS,4)
// RB6PPS<RB6PPS5>
extern volatile __bit                   RB6PPS5             __at(0x107D);	// @ (0x20F * 8 + 5)
#define                                 RB6PPS5_bit         _BIT_ACCESS(RB6PPS,5)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x267F);	// @ (0x4CF * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// RB7PPS<RB7PPS0>
extern volatile __bit                   RB7PPS0             __at(0x1080);	// @ (0x210 * 8 + 0)
#define                                 RB7PPS0_bit         _BIT_ACCESS(RB7PPS,0)
// RB7PPS<RB7PPS1>
extern volatile __bit                   RB7PPS1             __at(0x1081);	// @ (0x210 * 8 + 1)
#define                                 RB7PPS1_bit         _BIT_ACCESS(RB7PPS,1)
// RB7PPS<RB7PPS2>
extern volatile __bit                   RB7PPS2             __at(0x1082);	// @ (0x210 * 8 + 2)
#define                                 RB7PPS2_bit         _BIT_ACCESS(RB7PPS,2)
// RB7PPS<RB7PPS3>
extern volatile __bit                   RB7PPS3             __at(0x1083);	// @ (0x210 * 8 + 3)
#define                                 RB7PPS3_bit         _BIT_ACCESS(RB7PPS,3)
// RB7PPS<RB7PPS4>
extern volatile __bit                   RB7PPS4             __at(0x1084);	// @ (0x210 * 8 + 4)
#define                                 RB7PPS4_bit         _BIT_ACCESS(RB7PPS,4)
// RB7PPS<RB7PPS5>
extern volatile __bit                   RB7PPS5             __at(0x1085);	// @ (0x210 * 8 + 5)
#define                                 RB7PPS5_bit         _BIT_ACCESS(RB7PPS,5)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x2680);	// @ (0x4D0 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// RC0PPS<RC0PPS0>
extern volatile __bit                   RC0PPS0             __at(0x1088);	// @ (0x211 * 8 + 0)
#define                                 RC0PPS0_bit         _BIT_ACCESS(RC0PPS,0)
// RC0PPS<RC0PPS1>
extern volatile __bit                   RC0PPS1             __at(0x1089);	// @ (0x211 * 8 + 1)
#define                                 RC0PPS1_bit         _BIT_ACCESS(RC0PPS,1)
// RC0PPS<RC0PPS2>
extern volatile __bit                   RC0PPS2             __at(0x108A);	// @ (0x211 * 8 + 2)
#define                                 RC0PPS2_bit         _BIT_ACCESS(RC0PPS,2)
// RC0PPS<RC0PPS3>
extern volatile __bit                   RC0PPS3             __at(0x108B);	// @ (0x211 * 8 + 3)
#define                                 RC0PPS3_bit         _BIT_ACCESS(RC0PPS,3)
// RC0PPS<RC0PPS4>
extern volatile __bit                   RC0PPS4             __at(0x108C);	// @ (0x211 * 8 + 4)
#define                                 RC0PPS4_bit         _BIT_ACCESS(RC0PPS,4)
// RC0PPS<RC0PPS5>
extern volatile __bit                   RC0PPS5             __at(0x108D);	// @ (0x211 * 8 + 5)
#define                                 RC0PPS5_bit         _BIT_ACCESS(RC0PPS,5)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x2681);	// @ (0x4D0 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// RC1PPS<RC1PPS0>
extern volatile __bit                   RC1PPS0             __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 RC1PPS0_bit         _BIT_ACCESS(RC1PPS,0)
// RC1PPS<RC1PPS1>
extern volatile __bit                   RC1PPS1             __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 RC1PPS1_bit         _BIT_ACCESS(RC1PPS,1)
// RC1PPS<RC1PPS2>
extern volatile __bit                   RC1PPS2             __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 RC1PPS2_bit         _BIT_ACCESS(RC1PPS,2)
// RC1PPS<RC1PPS3>
extern volatile __bit                   RC1PPS3             __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 RC1PPS3_bit         _BIT_ACCESS(RC1PPS,3)
// RC1PPS<RC1PPS4>
extern volatile __bit                   RC1PPS4             __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 RC1PPS4_bit         _BIT_ACCESS(RC1PPS,4)
// RC1PPS<RC1PPS5>
extern volatile __bit                   RC1PPS5             __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 RC1PPS5_bit         _BIT_ACCESS(RC1PPS,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x2682);	// @ (0x4D0 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
